[
  "How a $47,000 payroll mistake almost killed my agency",
  "I keep seeing the same revenue leak in every company I work with and it's driving me nuts",
  "What makes you productive?",
  "To the Entrepreneurs with a spouse you build with... how do you balance it?",
  "Starting something",
  "How I made my first $10K in 2020 -2021 which funded my startup",
  "Four Hour Workweek Worked, But Now What?",
  "Do companies hire entrepreneurs?",
  "We have violated a fundamental rule of startups",
  "I used to think I needed a big idea or investor. How i started my onions business",
  "Started a skincare business selling at markets and online and I feel stupid",
  "Finally unlocking product market fit",
  "Best Notion builds for entrepreneurs?",
  "Microsoft ‘Business Assist’?",
  "How do you market your business locally on a budget?",
  "New Startup!",
  "Recommendations on a name for potential start-up?",
  "Five failed businesses and mentally unable to start another. Advice?",
  "How do I validate my idea?",
  "Advice for direction?",
  "3D printing & design",
  "Meeting with ip attorney’s and product developers",
  "Dental Advice Bot with upsell; idea validation",
  "How i grew my app",
  "Local Facebook Group",
  "Moving to a small town, ideas?",
  "Portfolio",
  "How to know when to take the leap to become a full time founder",
  "Welcome to ",
  "Sounds like you have grounds for legal action.",
  "Wow. This is horrible service on a very different level. Imagine their clients who are yet to wake up and realise this.",
  "Thera is the best payroll service. My team started growing globally and I got burned by Gusto, so it made sense to make the switch. Less expensive either",
  "That's brutal. Payroll is the ONE thing you pay these services to handle because screwing it up wrecks your business (and sanity). Insane how they didn't even have the decency to warn you when things broke. Good move cutting ties, after something like this I'd never trust another SaaS blindly again. ",
  "Talk to the IRS. They waived the penalty for the tax mistake my accountant (read: husband) made because it was our first incident and we resolved it.",
  "Seems excessive. I’ve used Gusto for 2 businesses over the years and it was like $20/month/employee.",
  "Irs has a one time forgiving thing for 941 mistakes.",
  "Legal action. Sue their ass, you defo have legal grounds and you should have reasonable chances to win.",
  "for what it's worth.  I agree with you.  Gusto is garbage.  They're one of the worst of 'promise the world' but never deliver.  Avoid 'em. Curious how thera goes for you",
  "Damn that’s messed up, we use Gusto with 2 companies and the 2nd one had issues getting the tax stuff setup right with the state. Please keep us posted",
  "Definitely sue them for breach of contract. You paid a fixed amount for their services, with a promise of specific and measurable tasks, and you have a quantifiable number for your real damages. This is the kind of thing you ",
  "Similar thing happened to me with Quickbooks Payroll.  Had to contact them multiple times to hear how they’ll resolve it asap and never figure out the problem.  When I got the IRS lien notice my language got stronger and they figured it out!  They claimed the IRS reassessed my payroll tax and didn’t tell anyone which I’m not sure I even believe.  They are covering my penalties as a credit since they did accept responsibility as the ones running my payroll. Still sucks to have a surprise $5k payment when you think you’re doing everything above board by hiring a professional payroll service",
  "I’m going to commit unspeakable acts if I have to see that stupid Gusto loading “friendly pig” one more time.",
  "Use Deel. I used them for years (Over 50 employees). They’ve been great. ",
  "Having been with ADP before Gusto and having used Gusto for years across 3 businesses , I can tell you that ADP is far worse and makes far more errors. That said, Gusto isn’t perfect by any means and getting an answer from them takes far longer than it should",
  "What's wrong with ADP? They've existed \"forever\", just doing this, they are quite affordable and have a really solid and easy to use payroll system. Yes.. you do need ONE person to process the payroll, but it's REALLY easy.",
  "I just started using gusto for my company. I'll definitely keep a closer eye on it. ",
  "Just want to share that rippling and other payroll software showed similar issues and a very poor attitude to fix.",
  "Whoa! That's terrible! I keep hearing about how great Gusto is and was considering moving, but now I'll stay right where I am. Wow!",
  "this is stuff within spectrum of running a small business. Just sue them, and make them pay your legal bills, lost business income, personal time wasted, and government fees. Let the lawyer handle it.",
  "This is the future AI automation has in store for us.",
  "God damn",
  "I would get a payroll service that guarantees their service. Quickbooks full service guarantees their work. So when they do mess up on late payments or a return they pay the penalties and interest.",
  "You have immediate grounds for legal issue. Run do not walk to your nearest attorney.",
  "Ask me about my bench.co and TaxRise nightmare.",
  "No comment. Just edited an EU call for AI automation of government processes grant proposals flagging precisely this shortcoming in their reasoning. ",
  "That sounds brutal. Payroll is one of those things where you ",
  "Using Gusto for 6+ years now for two businesses, about 30 heads total.  Never had a single issue.",
  "This is why it pays just to suck it up and have a payroll position where that person is your salaried employee. It will cost you more but well worth it.",
  "Was this for Q1 of this year? My company uses Gusto and I just got three late filling penalty letters from three different states. After looking into it, Gusto filed them all two weeks late even though they had the info and had been filing every cycle without an issue for the last two years.",
  "They always fuck up proper taxes.  But then never handle it, fix it, and business is stuck with penalty.",
  "This smells like someone who fucked up on their end and is now trying to complain online about it \"using a lot of stuff in quotes\" \"to try to pretend like they're really saying something\" \"but they're not\"",
  "that sounds really tough I’m truly sorry you had to deal with all that.",
  "Holy shit, OP. As someone who once accidentally paid an intern $90k(thanks, QuickBooks 'Learn as You Go' mode), I felt this in my soul.",
  "That’s sad thanks for sharing",
  "Hey, you can try Rippling - ",
  "I’m lawyering up all day on this one!",
  "I’d love to hear Gusto’s side of this. I believe they will cover all penalties if they are truly at fault. OP, you didn’t do anything wrong?",
  "...",
  "You are paying $600 per employee per month for payroll automation? 600x23 = $13,800 per month?... and there is no guarantee of accuracy or service-level agreements?",
  "FYI adp is no better",
  "Welcome to ",
  "You're absolutely spot on. I'm running a small plumbing company, and even at my scale, I've noticed this exact issue. Big plumbing firms around me spend thousands chasing new leads but drop the ball on simply following up quickly and clearly with the people already reaching out.",
  "I used to do online marketing for small businesses. Had a roster of like 200-300 clients. Most of my conversations with business owners was them screeching at me about how all of the reported leads were made up by my company. ",
  "Yeah basic shit. I go into a lot of companies as fractional CTO and I find most of them don't have basic document tracking.  They throw everything in Google docs and have no way to know what's what.  So I usually institute coda (similar to notion) and teach them how to use it with maybe a tutorial, a video or two, and lots of teaching by example since I use it religiously.",
  "do you have a Bible for this stuff? like a set of benchmarks you can just go through Salesforce with? ",
  "Unlike consultants, internal employees are a) not paid extra for figuring these issues or b) their ideas get rejected by managers and hence, they are not motivated to find such problems. As a result, these issues are common across companies. ",
  "yep, this is spot on. i’ve worked with business coaches across a bunch of industries, and this exact thing comes up constantly. everyone’s chasing “more leads” when the real win is usually in what happens after the first touch.",
  "Maybe share with ",
  "I took a Day Spa from $5k/mo to $75k/mo in 3 years. The single biggest thing that I attribute that success too is the \"lead\" follow up. ",
  "\"Average response time to new leads: 23 hours (should be under 5 mins)They follow up twice then give up (most people need 7+ touchpoints)Proposals sit in email for weeks with no follow-up",
  "Very true and something I need to fix myself.",
  "Totally happening almost everywhere. Spend a ton on leads and only the rare few desperate clients convert on their terrible sales strategy. See it all the time too. Typically when they’re telling me my leads suck before I listen to the call logs. Need to start vetting every buyer I sell to. You are 100% right on this.",
  "Thank you so much for saying this. Try to purchase solar, gutters, basically any mildly complicated service or product and the consumer is chasing the company for months!",
  "I've done stuff like this in a few companies.",
  "I can confirm that with recent results I got for a real estate company.  ",
  "This is ver interesting and valuable ",
  "My co-founder and I have built an AI voice agent specialised for outbound which address these pain points you've mentioned about response times and follow-ups ~ hope tools like this get more widely adopted across industries and improve the productivity of their existing teams",
  "for software devs, “do things that don’t scale”",
  "Preach. ",
  "sounds like you have skills as a consultant most people don't.",
  "This is insanely on point  I run a small data consulting firm and can 100% confirm we’ve been guilty of this. Right now we have one high-value client that takes up most of our time, and while I know the service is solid (we’re doing all of their reporting/ops analytics), I’m stuck trying to figure out how to actually ",
  "Im facing this same problem and looking to implement some fixes to up the win rate of current leads. ",
  "100% - The next-level of this approach is to upsell to your existing customer-base to grow wallet share. For SaaS - sell the value of the next tier for example. For established organisations (which I think you are referring to) upsell + cross-sell + new-sell = optimal and sustainable growth.",
  "I have a friend who is cleaning up by solving this problem. His offer is:",
  "Halleluja",
  "I’m trying to figure out Hubspot to help automate this. Everything is hard.",
  "How do you structure your compensation? Hourly consulting?",
  "You’re 100% on the money. Answer/return phone calls, show up when you tell someone (who is interested in giving you money) you will, answer emails somewhere between immediately and 24 hrs (even if it means you telling them\nYou saw their email and are looking into it).",
  "This is correct, eventually those leads do end up in the bucket of hope, but it makes a lot of sense to squeeze the heck out of them until that point. ",
  "you're going to love 'Watertight Marketing' (book)",
  "I worked as a copywriter for a while and saw this in so many places. They usually hire a copywriter because there is some crisis going on. I'd get in there as ask questions and whoops, the return call rate was fucked. ",
  "yeah",
  "I’m seeing this in our own business. We have a huge database of leads (direct to consumer but high ticket sales). Not sure how best to start testing ways to reengage/get back in touch.",
  "Could you add a customer request to time the response time via email/phone/text to get data before approaching the business? And evaluate the response quality? Then you have good data point to sell the optimization service. For example, I contacted a car dealer about a specific car listing. They add me to email blast and do not answer the question about the car (no human read the form submission).",
  "I agree totally, and would add that a sensible follow-up cadence can be equally crucial. If you get left on read for a day or two, drop a quick, respectful reminder. Do the same 1-2 weeks later if you still haven't heard anything. From there, drop in once a quarter until you get a firm no. ",
  "Very prevalent in my space (commercial finance). ",
  "I agree. Too often we are so focused on \"New\" business we neglect our legacy business. No matter what your business your legacy customers always have new business needs and even if you can't provide for their new needs you might know who can which then makes you more valuable to them.",
  "you should go talk to the 4 big consulting companies.....b/c they are the ones pushing it.",
  "I’ve seen this a few times, people are usually sitting in a gold mine of leads that they never reconnect with.",
  "AI generated copy 😂🤣",
  "I've seen it for decades.  The problem has remained stubbornly entrenched through the years and massive changes in technology.  I feel like it's an interesting combination of two human nature problems.  One is at the front end, where it's just sooo much easier to wait for something to happen than make something happen even if you are waiting on a dime during the period of time where you could be making a dollar.  The other is on the back end where correlation is perceived to imply causality.  \"For every ten leads, we make $10, we want to make $100 so therefore, we need 100 leads.\"",
  "Man I am seeing this with every local company around me right now. Call, they come out to assess (lucky to get a quote without an in person visit for anything), get a quote and a date for them to come out, they never show or follow up. I call, text, message, no answer just ghosted. They keep running ads, posting on FB groups and everything. Like how are these people making money?",
  "Damn idk if I want to become a plumber or fix sales. Either way this advice works for both 🫱🏽‍🫲🏼",
  "I want to confirm that what you said is on the money about what’s going on for us. So true",
  "I recently needed to replace my roof. I called 3 local roofing companies. One of them got back immediately, came to my house and gave me an estimate. I was very impressed, however then the sales pressure tactics started. Which I didn't appreciate. I would have used them otherwise. \n ",
  "over the last 25 years, my company growth was by word of mouth",
  "I’ve consulted/trained in automotive for 10 years. Every single one would rather spend on advertising rather than get better at closing what they do get and treating customers like humans. Not even well, just normal.",
  "That and lost deal recovery which is something I am focusing on now.",
  "Interesting",
  "This could be applied even to private practice: psychotherapists. The response time to each client can end up being too long for the client and so they go elsewhere, like to an inferior BetterHelp-type company. But if therapists ensured they had good admin skills, then they could really benefit. I know this isn’t the exact demo. But it makes so much sense what you’re saying!",
  "I think, standing back, what I see is that companies have a bunch of data and don't know how to use it to evaluate systems and processes.  I'm an HR consultant and people don't know that their actual culture, not their intended or marketed culture, is in the data.  So are ways to change it.  They don't know that you can measure unhappiness or toxic pockets by looking at data on theft, padded expense reports, time card fraud, ER issues that are more about personality than something that's an actual code of conduct violation.  And NO ONE uses recruiting data properly.  If I were to do a three year look back at hires, I would want to see who the recruiters and hiring managers were, what the interview process was, where they were sourced, what companies they came from, and any other commonalities of current employees.  I'd look at the same info for people who had since left the company, vol or invol.  I heart data so hard.",
  "Totally. I’ve seen the same thing... teams chasing more traffic while ignoring the leads already knocking at the door.",
  "Quality over quantity.",
  "Welcome to ",
  "Promise of money that is 10X the effort I put into it.",
  "I journal all ventures, initiatives, etc and also sleep without my phone nearby tbh",
  "Cheese",
  "I Have been trying to get a job for 3 years. I have two master's degrees AND SPEAK AND WRITE FLUENTLY IN 6 languages, and I am a US CITIZEN. I have tried networking in person and online, attending job fairs, making recommendations, and getting more certifications. Nothing worked. The moral of the story: jobless since May 2022, over 2000 applications filled out, over $25000 spent in networking events, classes, lunches and dinners, travels, conferences, seminars, workshops, online certifications, grants applications, general meetings, interviews, Tests, accreditations, interrogations, inquisitions, background checks, finger-printings, medical exams, drug tests, check-ups, mental check-ups, psychological check-ups, psychiatric check-ups, autoimmune check-ups, all kind of psychological tests, job-specific examinations, oversees travels, abroad meetings and STILL CANNOT GET A JOB or even an internship, or a remote or a hybrid or part-time or per project work, I cannot get even fundings, loans, grants, lines of credit to open my own business. I am left with $250.000 of student loans, among other debts. This is the Real American Dream",
  "What works for me is a solid morning routine that includes some cardio and a tech-free morning journal session. Keeps my focus sharp and mindset positive throughout the day. Also, setting clear goals with time blocks helps me avoid burnout while trading crypto or grinding in games like Vampire Survivors.",
  "Leaving my phone in an entirely diffferent room.",
  "producthunt is a joke",
  "My non-AI app made $8000 USD in 2 months. Here’s how I did it",
  "Made my first $7k with my SaaS in 9 weeks. Here's what worked and what didn't",
  "Getting ready to launch my first ever web application🤞",
  "If AI Eats the Clicks, How Do You Get Users for Your SaaS?",
  "Pushing closer to 30k MMR, it's not easy to grow",
  "People who started successful SaaS, how did you get the idea?",
  "I just launched my SaaS!",
  "Tips for successful launch",
  "Day 1/30: Organic Marketing Challenge For My New App",
  "SaaS pricing isn't math, it's psychology.",
  "Testing new site - it roasts websites - post yours",
  "Launched: Peekaboo – See How Visible Your Brand Is in AI Search (Now Free to Use)",
  "Promote your SaaS. what are you building, and who’s it for?",
  "Do I even need Google Ads?? 🤔",
  "Solo founders & tiny teams - what’s the one thing you still can’t hand off to AI?",
  "Reddit bots for marketing ?",
  "What’s the Best SaaS Advice You’ve Ever Received?",
  "I’m getting tired. It’s hard to find what works at scale",
  "Check out willpayforthis.com if you're looking for SaaS ideas",
  "Founders building with AI — what are you using it for beyond MVPs?",
  "How is my Privacy Policy?",
  "Want to boost your local SEO?",
  "whats the reason you have not yet moved to cursor ?",
  "Need help with backend automation offers",
  "I have 32k Twitter followers. Dozens signed up. 0 paid. Audience ≠ customers.",
  "Built a city database to help remote workers pick their next destination. Feedback is welcome!",
  "Best tools for SaaS startups, what do you recommend?",
  "It’s good for nothing these days, unfortunately.",
  "Normal people never look for products on producthunt.  It’s just a bunch of entrepreneurs using the website.",
  "50 new subscriptions, 1.8k total signups => \"Loved by 8336 creators\" on you website :) Tell us the truth pls",
  "it's all about $$$$$. you would be shocked at the amount of money people are throwing at everything. no chance against the algorithm even if you have found AGI.",
  "I'm also facing a similar question. Just today I posted a question on the subject, because I only received 3 votes but I did customer discovery research and built up a significant infrastructure, and now I don't know if the failed launch shows that there is no need for it in the market, or if it's not really proof.",
  "PH is not what it used to be, it's true. The way I see it today, the platform can help put you on the map, offer early social proof and feedback. You may attract some traffic and a few early adopters, but it's crucial for the product to be of interest for the PH audience. Not all SaaS are even considering launching on PH, and that's for a reason.",
  "If you advertise on tik tok you’ll get seen by the youth of today. :)",
  "Well it's pretty good for backlinks.",
  "Talking about jokes… seriously have you used any “PH alternatives”? ",
  "Agreed and the worst think is that it freaking cost too much",
  "Is glazed turning a profit though?  The difference in results is easy to explain though. AI is hot right now. Even highly saturated ideas like AI avatars get a lot of attention. It's not a surprise glaze is doing well while your other project is languishing at PH.",
  "Well I have been reading similar posts lately and I have been debating if I should use my connections an build a premium version of producthunt where you get to meet investors and get voted by a community of professionals. You can also get matched with advisors. Sort of like shark tank but get help building and get real results.",
  "Finally, someone's saying it!",
  "Agree maybe a backlink but at this rate I doubt that too.",
  "Product Hunt is not organic. It's gamed. People pay for good launches and they pay for votes. ",
  "so the key for sales is add \"AI\" in product name huh, jk",
  "Hey nice build! If you want more attention and a better alternative, please list it on ",
  "if anyone has good directories link them up in here and I’ll check them out. i’m sure others would be interested as well.",
  "Interesting. For any of your past launches, did you try a different marketing strategy? Like sharing your Product Hunt link and actively asking for upvotes? Maybe that played a role.",
  "Totally get what you're saying. PH feels more like a ",
  "I love hearing about non-ai wrapper products that just serve a purpose!",
  "Love how you turned a dying product’s niche into your launchpad, great timing, solid execution.",
  "Great info and congrats! I believe that if you can solve someone’s problem, especially if it’s simple to use, how you achieve it is irrelevant.",
  "Fantastic job! Simple, no AI hype or AI BS, no wrappers, just a problem, a solution and TIMING! Congrats!",
  "Why wouldn’t people use WhatsApp/ Telegram / Facebook call? Just curious",
  "You killed it by spotting the vacuum Skype was leaving behind, I was bummed out to hear they were retiring skype because I literally only use it for the international calling feature. Awesome stuff",
  "Great write up. Thanks for sharing. I love how you spotted that opportunity.",
  "How are you dealing with / going to deal with the new  10DLC compliance requirements?",
  "Kudos on finding your niche and nailing it!",
  "How do you talk about your app on Twitter everyday?",
  "Like a boss!! Well done!",
  "Clever!",
  "What tech did you use to make calls? What service do you use and what’s your margins?",
  "Well done friend!",
  "I love this and need it so much. Are you considering getting other area codes in Canada - like big city ones - 613 in Ottawa and 905, 647, and 416 for Toronto?",
  "curios, did you take action on levelsio tweet? Or did you had the idea yourself",
  "Thats was very helpful! \nThank you for sharing!",
  "Great implementation speed tbh. Very nice niche  product",
  "Congrats!",
  "Congratulations 🎊 👏 \nYour execution is remarkable \nVery well done keep scaling and keep growing 👍",
  "how did you collaborate with journalists? do you already have contacts? how does that work",
  "Really valuable story.Thanks for sharing",
  "I have heard SaaS founders complain about the difficulty of dealing with paying taxes when doing business in the EU, because of so many different systems.",
  "Great! Thanks for sharing this story. Congrats on the $8K – well deserved!",
  "Have you tried targeting outbound sales teams with ads? Ads work really well when you niche down the targeting and speak to the tight people. Good work on the product!",
  "How did you collect initial feedback from users about your product? Was it done manually or automated?",
  "I noticed that you said ads didn't work, but didn't explicitly stated how Facebook didn't work. From my experience with my wife's e-commerce site meta ads absolutely have been working and working well. Just curious how long you ran an ad and how much money you put into it.",
  "Love the combination of creativity with social media.",
  "great write up",
  "Liked the journey pal. Good job",
  "Impressive hustle! Your adaptability and niche focus paid off.",
  "Ngl this was refreshing to read!",
  "Have you considered partnering up? It could help spark new ideas, grow Yadaphone, and even launch more SaaS. I’m a software engineer with 5 years’ experience—would love to chat if you’re open to it.",
  "Congrats",
  "I’ve heard that is an excellent opportunity to start creating content on LinkedIn since most of the users don’t do that. Now I can confirm that even more! Congrats 🎊",
  "inspiring story , building something without ai ,  in the era of ai is such a great thing and love your marketing strategy , thanks buddy",
  "Thank you for sharing your experience \nThis motivates me in my saas journey",
  "Good Job brother. Wishing you all the best for your more upcoming endeavours.",
  "Proof intimately knowing your users’ problems is the best path to a successful business.",
  "There is a way to call with my personal number as a caller id with your app? Also: do you have planned to insert a monthly fee for unlimited calls?",
  "Wowww congrats! What were the costs and what’s actual profit?  💗💗💗",
  "I loved the breakdown, especially your approach and the effectiveness or lack there of, of the marketing channels. \nI usually use WhatsApp or FaceTime to make international calls so I’m not your target audience. I can however, appreciate identifying a need and creating a solution that works even though it’s not pretty.",
  "This post is awesome. Kudos on spotting the opportunity and executing it so well.",
  "Wuhuuu",
  "That’s really cool man, congrats! I used to use Skype back in the day to cold call international customers lol. ",
  "Your observation of the opportunity and fast response to bring a product to market is really fantastic.  I hope you get to do this a 100 more times in your life.  You certainly have the skills now and you know what success looks like!",
  "How did you program it in a weekend? That's something only an experienced dev would be capable of doing.",
  "Right below your post I see a Reddit ad promoting some other company OpenPhone.. copy says “RIP Skype. Switch to OpenPhone. Port your number for free today”.",
  "Literally what I’ve been trying to find, thanks!",
  "Seems amazing! I was looking for something like this. Do you have any iOS or Android app?",
  "Yes, I think apps should be developed based on specific needs rather than for a particular technology.",
  "How much actual market research did you do before you started? I studied business studies and have a bachelor in entrepreneurship, and got absolutely bombarded with the importance of extensive market research, competitors, models and analyses, value proposition, environment analyses, etc. I feel like most people that are successful nowadays with SaaS- and other kinds of businesses don't do much about strong, extensive market research.",
  "I love your story for the simple fact that you acknowledge your past failures and how you've learned from them and leveraged them for your current (and future success). Way too many successful entrepreneurs leave out the part where they failed on previous ideas so they can look like wunderkinds.",
  "super small Feedback.",
  "Well done! Congrats!",
  "Overall products like this a breath of fresh air. I love it. I will keep it in mind if I ever need something like this in the future.",
  "Well done 👍🏻 , keep going bro",
  "Congrats man! That's a perfect combination of opportunity and vision for you.",
  "Great story that isn’t AI generated - thanks for the inspiration! A breath of fresh air.",
  "how did you get funding for doing all these",
  "Definitely seems like you worked on marketing part more than building the tool itself as someone who is new is Saas market you could definitely share some resources you used through your journey like building the frontend etc",
  "These types of SaaS perplex me. I can get a blog post with just a lazy prompt on any LLM. Why would someone pay extra for it? Is there an extra killer feature that I'm missing?",
  "I tried your site and learned very quickly I need to fix how my site appears on the web.  Your llm got everything about my site details incorrect.   Looks like I need to fix that first.",
  "Why do you think that cold outreaching to users on LinkedIn went wrong?",
  "Ok for niw I'll give you a benefit of a doubt, will try your tool as it might have some uses for me but imho you are posting here too frequently",
  "Hey nice build! If you want more attention, please list it on ",
  "In America we have names like “Karen” or “Chad” to classify certain stereotypes. What names exist in your country or region that do this?",
  "Why aren’t former American Slave Plantations treated like former European Concentration Camps?",
  "Are There Any Active Serial Killers Right Now?",
  "What happened to covid? Is there nothing about covid to worry now?",
  "Why haven’t the Epstein files been released yet?",
  "\"If I die of AIDS - forget burial - just drop my body on the steps of the FDA\". Is handling a corpse as an act of protest actually legal? And has it ever been done?",
  "At what age do you stop saying “girl” and start saying “women?”",
  "One time a guy told me if the way you use your PTO at a job is by taking 1-2 hours off of work often it makes you look bad. I was just curious if people agree or disagree?",
  "Confronting my boyfriend after I caught him getting physical with my sister?",
  "Men, do you get catcalled? If so, how much and why do you think so?",
  "What’s the worst trait you’ve noticed among Redditors?",
  "In Sign Language, when there's new spoken slang, does it also create new signed slang, or do signs get matched together for that slang? How is sign slang created? Is it just like spoken, just getting it to trend?",
  "Why do people consider fish to not be meat?",
  "If people could respawn, could death become a form of adrenaline rush that people do for fun?",
  "Why are you not allowed to lie to the police but the police can lie to you?",
  "Has any other ex-Christian felt deep grief after losing their faith?",
  "If human bodies replace all of our cells every 7-10 years, why are we able to remember things from more than 10 years ago?",
  "People who misuse the public toilet why do you do it?",
  "Vape Shops look like they took their style from Vegas!",
  "Is it normal to not want to have a relationship?",
  "My 6yo nephew has a condition that causes one eyelid to droop... Can you help me assemble a list of famous people with similar conditions to show him?",
  "Why do so many religions consider pleasure to be wrong?",
  "Is it normal to feel like I’m just \"pretending to be an adult\" most of the time?",
  "Do you think in general, society would be happier if we didn't have internet on our phones?",
  "Should I call off work because I have no gas to get there?",
  "What does it mean to \"Know how to cook\"?",
  "What are some unwritten rules men should know for approaching women decently?",
  "Why do true crime shows have the worst victim picture?",
  "I live in an area of the U.K., in a University town, where a LOT of the students are extremely middle class, loud and confident: \nthese men are all called Josh. No exceptions.",
  "In Mexico we have \"Brayan\" (spelled like that), to make fun of lower class hypermasculine males that embody a certain urban attitude. A little ghetto, aggressive, etc. ",
  "Enzo is basically a typical cringe Gen Z boy, and everything that surrounds that. (Country Brazil)",
  "In China, Zihan (gender neutral name that sounds good but has no actual meaning) refers to a Gen Z kid who's probably cool themselves, but their moms are total karens who always troubles teachers. By comparison, Yaozu (literally means \"glorify ancestry\") is a boy who got spoiled by his patriachal and misogynistic family members that mistreat his older sisters, and arrogantly believes that everyone else around him, especially all females, are inferior.",
  "From the 90s: Sjonnie and Anita, for essentially white trash.",
  "In Germany \"Justus\" is a privileged 20-year old with rich parents who likes to show his wealth. Classical Justus...",
  "Bruce and Sheila for the Aussies",
  "Back in the 90s when I was a kid (UK) I remember people using \"Shazzas and Gazzas\" to refer to I guess kind of basic/rough working class people, especially younger people. It's not something you hear now, I suppose because not many Brits are naming their kids Sharon or Gary any more.",
  "In Poland we have Janusz and Grazyna for middle aged know-it-alls, Oskarek and Julka (dimunitive of Oskar and Julia) to describe extemely left leaning rich kids who don’t know shit about life and Sebastian and Karyna to describe uneducated young people who drink, smoke and are prone to violence over some football team or any other nonsense. It’s also about the looks.",
  "Kevin, Justin, Chantal, Mandy, Jacqueline amongst others in Germany. ",
  "A Brian, in Denmark is generally considered to be a dim, show-off’y dude.. The kind of person that in America might mow down 3 people leaving a Cars and Coffee event in a Mustang..",
  "When I visited the South (US), I heard “Bubba” used to refer to rural poor conservative middle-aged men. There may be some more nuance that I missed.",
  "in the netherlands, an “Anne-Fleur” is a basic girl who’s into shopping and being pretty and all that",
  "Kevin and Jaqueline (Austria), the epitome of white idiot kids of 'trendy' Astrology moms.",
  "Growing up as an Anglophone in Quebec, Jean-Guy was a catch-all for a French redneck.",
  "Kevin Nguyen and Tiffany Tran. American/Canadian-born Viets that are heavily westernized and into frat/rave culture. Known for being fuckboys (or fuckgirls?) among other things. Not really part of a region per se, but.",
  "I love every bit of this thread.",
  "In Norway, I believe it’s a Harry, and going to Sweden or Finland to buy cheaper alcohol and stuff is a Harrytur!",
  "In Spain I understand that Charo is Karen. Unsure about the name for Chads as I've been out for a long time but before I left we simply called them downside Dorito as they all have skipped leg day for years and years.",
  "Jalen in America is the name of a biracial black boy, with a white mom. He wants to be in the NBA and has a broccoli haircut. Neveah is his female equivalent.",
  "Mexico:",
  "In Argentina:",
  "I’m from the U.S. but live in Thailand. For lazy drunk older men stuck in past, traditional ways  and thinks they know better than others, there’s a stereotypical name: Uncle Somchai",
  "In the US military, Jody is the guy banging your wife while you're deployed away from home. Yes, I know that the military is not a country, but most of the guys who are talking about Jody are in fact in other countries when they're talking about him. That counts, right?",
  "We use “rosbif” to characterise the red shouty English person.  English people call this type of person “gammon”.",
  "Not so much the name on it's own but there's Hoorray Henry which is a man who is too posh in England.",
  "We have Janusz and Grażyna for boomers, Dżesika (so polonized Jessica, making fun of people naming their kids foreign names that feel out of place and pretentious) for a white trash young women and Seba for a lower class sportswear wearing skinhead type",
  "Kévin is québécois Kyle, trashy guy that loves monster and punch holes in walls.\nI know kevin is an english name, but it's popular for Working class québécois to name their children an english sounding name, while it is frowned upon in classes with more social capital",
  "As a fellow American, I'd add \"Gomer\" or \"Cletus\" for a hick, and \"Guido\" for a Chad of Italian-American descent.",
  "Many are. There are plantations converted into historical sites and the like. ",
  "Because the post Civil War governments didn’t seize the land of plantations. They remained private property that have been bought and sold many times. The European concentration camps were government property.",
  "I think the opening question is misleading to start with.  ",
  "The concentration camps ceased to operate after they were liberated while the plantations continued to operate as working farms, albeit now with (poorly) paid laborers after slavery was abolished.",
  "the Civil War is around 200 years ago ,Slavery is a very old institution that continued for thousands of years in different forms in different parts of the world, it was still practiced in most of the world until fairly recently. ",
  "For the same reason that we admire European castles even though they've been occupied by tyrants and oppressors. They are genuinely pleasant to look at and visit. They have a rich and storied history and they are part of the country's culture.",
  "Because such plantations are more-or-less definitionally grand old buildings, and basically ",
  "Why are manor houses/castles in Europe treated as glamorous? ",
  "Because the landowners who enslaved people were also allowed to keep their property after abolition and were generally treated very softly compared to how the Nazis were after WW2.",
  "I think that`s because concentration camps were only built and used for genocide and jails.",
  "The Arch of Titus celebrates the sacking of Jerusalem and was likely built by slave labor. Yet somehow, millions of tourists flock to it every year without controversy.",
  "If we had to turn every place slaves were kept into a memorial half the land on Earth would be a memorial. ",
  "People arent really that ashamed",
  "What, were you just going to confiscate and close like ALL the privately held farmland in the entire south and turn it into museums? People are repurposing the plantations as farms and beautiful spaces, they aren’t partying in the since-razed slave quarters.",
  "My family came from sharecropping in Georgia. Which means they come from slavery before that. If my grandmother told herself every day she was walking into Auschwitz in order to pick cotton for money, I am sure she would not have the same wonderful spirit she has now (she is 100 years old in August). ",
  "The Whitney Plantation is. It’s the only one that’s truly dedicated to preserving the history and experience of the enslaved people who lived there. It’s worth a visit if you’re ever in the area. ",
  "Plantations are more like castles than concentration camps, if you are looking for a metaphor. How many castles focus on the atrocities committed there?",
  "It comes down to image.",
  "Ancient Greece and Rome were built by slaves, and we don't treat their ruins like Auschwitz.",
  "These were family-owned homes, not military installations. It really depended on who ended up owning them. Some were converted into history centers/museums, and some were just passed on to new owners to do with them what they wanted.",
  "You have it backwards. The nazis had some 15,000 camps of which 8 are preserved as museums(although a larger number of memorials exist). The americans had around 46,000 plantations, of which 375 are preserved as museums(again even yhe wedding destination probably had a commemorative plaque somewhere)",
  "The FBI revised its estimates for serial killers about a decade ago. The are probably between two and three dozen, with a significant number working in long haul. ",
  "They don't really talk about serial killers on the news anymore since it only encourages copycats and more killers. It was really bad when they're given a name. The focus is entirely on victims.",
  "Look up FBI long haul trucker serial killers. That's called the perfect job for a serial killer.",
  "Yes, lots of them.  The serial killer research project at Radford University has tracked every serial killer they could find data on, globally, going back to 1900, and they show in just the US alone 215 examples that started killing people in the 2010s, and 26 after 2020.  Now those numbers come from 2022, so the actual 2020s total will be a hell of a lot higher.   If you're curious, globally those numbers are 424 and 47.  Yes, the US produces a wildly disproportionate number of serial killers, and nobody is sure why that is.",
  "Likely at least 50.",
  "This is obviously a serial killer trying to figure out if anyone is on to him. ",
  "25-50 actively killing in US at any given time.",
  "Theres an active scene in Rhode Island/Mass rn where they keep finding body parts in the woods",
  "Of course. But it's kinda hard to know anything about them until they've been, you know, caught.",
  "My childhood friend got murdered by a serial killer this past year. Luckily they caught him now he’s in federal prison.",
  "As far as my understanding goes, there's supposed to be one in BC, along the highway of Tears. Over 50 missing Native women and girls. ",
  "There seems to be one that preys on Lumberton, NC.  I specify preys on because I think it’s someone who either travels a lot as a profession (i.e trucker) or who opportunistically visits.  Several young lumbee women (mostly girls involved in sex work, drugs or otherwise homeless) have been found dead in outlying ditches over the last few years, often 2-3 days after their time of death.",
  "I think there’s one in Austin around Lady BirdLake",
  "In Austin, Texas, we have males in their 30's randomly \"drowning\" overnight in our local downtown Lady Bird lake, \"river.\" \nSo, says the reports. But we all know, we know something is happening that the media/police can't explain.... Yet..",
  "It's been a few years already since they got him I think but there was a serial killer in Toronto who was also a gardener, and he hid his victims' body parts buried in the yards of his clients.",
  "The Sackler Family",
  "This guy got caught last year in Portland.  3 known victims.  Probably more. ",
  "Absolutely, there are, but they are less publicized these days, as there is a solid theory that giving them media attention fuels them.",
  "You mean aside from United Health Care?",
  "Ted Cruz is the zodiac y’all",
  "Parents are gifting me $25,000",
  "Billed $1,300 for a \"free screening\" from my urologist",
  "should i just wipe my credit card debt with savings?",
  "Feeling frustrated because parents want me to put their new car under my name and co-sign the loan",
  "Retirement and Finances",
  "Should I sell my car to pay off $19k credit card debt and save for a cheaper one?",
  "Used to work at Target, still have 8k in the 401k. What should I do with it.",
  "Any tips for helping my retired parent start investing?",
  "What percentage of your income should be dedicated to your vehicle?",
  "What can I use my FSA for?",
  "Should I temporarily reduce my 401(k) contribution to pay of CC debt?",
  "Is it bad to open lots of credit cards for free stuff?",
  "What to do with savings",
  "Is there a term for when your savings interest rate is higher than your debt interest rate?",
  "Making ends meet while waiting to receive sign-on bonus",
  "Father gifted me 13k, what should I do?",
  "Should I cash out my universal life insurance policy or keep it?",
  "how does a credit card work ??",
  "Too many 401ks, should I roll it all to current company?",
  "22 and in $23K of Debt After Flight School and Failed Sales Job – How Do I Actually Rebuild?",
  "Unemployed, should I pay off my debt?",
  "2 IRAs + 401k + New 401k what to do if anything?",
  "Moving across the country, when to buy new car?",
  "New Job worth move to higher cost housing?",
  "What do I do with my money",
  "Wakefield and Associates",
  "Need to get a new roof. Should I get a loan or wait it out?",
  "Is there a “realtor advisor” like there is a financial advisor?",
  "Nothing. Put it in a bank account or a shorter term CD and just let it sit there for a minute. There’s no hurry to spend it. ",
  "Without any context to your finances its hard to tell you what to do with it.  Do you have any high interest debt?  Pay that off first.  Moving on if you're in a spot to purchase a home that'd be a great down payment, or if you aren't putting 7000 into an IRA and the rest into an HYSA would also be a great idea.",
  "Damn I wish these were my situations 😭🙏pay off any loans, Max out Roth IRA, and put the rest in a high yield savings account",
  "Totally depends on what situation you're in. Do you have any high interest credit card debt or other loans? Do you own a house? Are you in a decent paying job?",
  "I’m Canadian, so some of these terms might not make any sense unless you’re also Canadian, but I would look in to starting a TFSA and chucking it in there first if you don’t have one already. From there you can think about investing it yourself or with a financial advisor, but in the meantime it can accrue some tax free interest.",
  "The best thing you can do is open a Roth IRA and put $7,000 for 2025 invested in s&p500 index fund.",
  "Just invest it in QQQ or SPY. Idk how folks here are being cautious about those",
  "Side note: have them give it to you in two transactions. One can be technically from your mom and one from your dad. This allows them to stay under the $19k per year, per person IRS gift limit and they won't have to claim it on their taxes.",
  "I mean, easiest path that I’m sure you’ve read 1000x on this sub would be: Set up emergency fund of 3-6 months of expenses in a high yield savings account 3.5+% APY, pay off any high interest debts you might have, max out a Roth IRA and invest in a total stock index fund or sp500 fund, pay off low interest debts and/or save for any goals like a vehicle, down payment on a house, etc, or just invest more in a brokerage account.",
  "If you save it that's a decent down payment to get a house",
  "Invest it responsibly and in a tax efficient manner. Inferring your age a bit, look at opening a Roth IRA and investing in an index fund. Open a taxable brokerage and invest a portion in index funds (look up 3 fund portfolio) for a future home down payment.",
  "That’s huge and congrats. Depending on the age and lifestyle I’d pay off all debt if you have any. If not, college tuition it could be useful. I’d say just try to use it to avoid as much debt as possible. Besides that id set up an emergency fund for like 3 months of income in a high yield savings account if you lose ur job or something. Then the rest id just invest…. Play it safe and just put it into s&p 500 and u move some of that into other stocks after researching. U can probably take 2k and spend it something nice for urself and a nice dinner for ur parents too. I think they’d appreciate that.",
  "What state are you in? This sounds like a bait and switch scam. If the office that sent the “free screening” offer can’t demonstrate they really were doing free screenings, they might be violating rules in your state. ",
  "Screenshot the email confirming free screening and send it to them",
  "Tell them \"I came in for the free screening, that is what was on my confirmation email. Here is said email. If you performed something that ",
  "Common bait and switch they do. I don’t have any advice but I’ve heard of this happening before. It’s free up until you trail off and change the conversation topic with the doctor, you start talking about other things and all of a sudden it isn’t free. It’s a trap",
  "OP even if the screening morphed into a regular visit 1300 dollars seems extremely high and something your insurance should’ve written down (deductible or not). You may end owing something but that seems extremely excessive.",
  "I had to switch dentists and I found an ad for a local office that offered a free cleaning for new customers.",
  "This is something that all doctors are doing now.  I went in for my yearly checkup and we discussed issues as I'm aging.  Bam, I got charged for a visit due to getting a new treatment recommended.  What's the point of the yearly exam if talking to your doctor about anything going on will charge you anyway as a different type of visit?",
  "one star reviews on all review platforms and name the doctor.",
  "I am not sure if this act would apply here. It depends on the specific circumstances. But it is worth investigating.",
  "This happens all the time with us, we go for our free annual checkup and find a bill for $400-500 each after a week. my wife then has to call the doctor's office and argue with them until they recode everything so that it counts as an annual free checkup.",
  "You may be able to get the price reduced by getting a retroactive referral from your primary care provider",
  "Complaints to the state ag office, medical ethics board, and your insurance company. At best this was \"bait and switch\" at worst outright fraud.",
  "Call your states’s Board of Medicine. There are likely protections for you in the Medical Act for your state.",
  "File a chargeback for the $140 you paid too.",
  "I would start by reaching out to your PCP to see if they will put in a referral for urology retroactively. I believe a referral can be placed retroactively up to 30 days(?) after the specialist visit, at least in my state.",
  "Do you have ACA insurance? In my experience, doctors will almost always try to convert those \"free screening\" visits into an office call by getting you to talk about things that fall outside the umbrella of a \"free screening.\"",
  "Don’t pay it tell them you’d rather owe them than screw them out of it.",
  "Reach out to the patient advocate for the hospital/clinic system, explain the situation. They often escalate it to managers. Unless it’s private practice the doctor does not have much control here. They will light a fire under the clinic until your problem has a definitive answer. If you booked under free screening and that was what you were under the impression was happening, they should not be charging you for the visit.",
  "This is legal because you brought up another issue on your \"free\" visit.  You received more than just a screening. The screening was free",
  "That’s beyond frustrating, and honestly it sounds like a bait-and-switch. First step is to dig up that original email confirmation with the words “FREE SCREENING” and save it like gold. That’s your proof. Then file a formal dispute with the clinic’s billing department in writing, referencing that email and every detail of the scheduling switch. If they won’t budge, escalate it to your state’s medical board and insurance regulator.",
  "Part of this definitely sounds like shady business practice.  Part can be chalked up to \"things people might not understand about insurance\" until they are looking into it.  A few things that caught my attention:",
  "Same exact thing happened to me with a colonoscopy. Since I have a very strong family history of colon cancer, when I turned 19 I was supposed to start getting a colonoscopy yearly, (because my dad died of colon cancer at 29yo) but just got my first one in 2023 when I was 23. Every appointment was “this will be a screening based on family history”, yet when the colonoscopy was scheduled and I’m all checked in, they go “and that will cost 1150 how will you be paying today?” LIKE HELLO??? They said because I mentioned anal bleeding ONCE due to an internal HEMORRHOID that my colonoscopy was now not a screening, and insurance wouldn’t cover it. LIKE WTF?? HOW IS THIS LEGAL??",
  "First, good on you for getting yourself screened. Hope it turned out to be nothing.  ",
  "Tell them to kick rocks and that if they continue to harass you you'll be contacting a lawyer for false advertising and predatory practices. ",
  "I’m wondering since you have a family history they coded it as a diagnostic test instead of just a general screening. Were you having any symptoms?  That can cause a coding change as well. Definitely call your insurance",
  "Replying specifically to your edit, OP.  Honestly, this shouldn't rely on how they coded it.  Or rather, you shouldn't be on the hook automatically because they coded it wrong.",
  "If you’ve tried to work it out with them and they refused, report credit card fraud and complain to your state’s attorney general. Make those greedy scumbags sweat.",
  "Small claims court is not difficult to navigate you can do it one afternoon and you’ll save yourself 1000+ dollars.   More than likely, the doctors office will want to settle.",
  "Yes. You're buying $",
  "I would still make it a policy NOT to hand over payment until i have all the required information to make sure amounts are correct.  Sending me a bill when my insurance covers services seems unreasonable.  If they can’t provide reasonable information, like the charges was this for this item, and insurance covered this amount, then they are sending an incomplete bill.  And I would need that information to verify with insurance payments.  If they don’t match, they have incompetent staff or they are a shady practice.  ",
  "Yup! My primary doctor did the same thing to my regular annual visit. I’m in the process of finding a new doctor.",
  "I've seen this with vaccines, too. They advertise it as free, but require insurance when you get there. Really stretching the definition of free to mean \"Free to ",
  "Something like this happened to me and I called the hospital. I was adamant that three different people had told me it would be free and that I would NOT HAVE DONE IT if it hadn’t been. They removed the charge. You might be able to get out of it by complaining.",
  "100% absolutely use your savings to pay off your credit cards. Credit card debt is basically a financial emergency, and a totally worthy reason to deplete your emergency fund. Focus on living within your means (make a budget) and work to re-establish your e-fund moving forward. In the event of a true emergency while you have nothing in savings, you can use your cc and be no worse off than you are now.",
  "This is the exact reason you have an emergency fund. 20+% debt is an emergency.",
  "If you think “nothing Wild” is having $8.4k in credit card debt at 18 years old, that is a bigger problem than the symptom.",
  "That does not apply when you are paying 28% interest!",
  "What if you did $6-7k, keep $2-3k, and pay off the remaining $1.4-2.4k aggressively? There is a reason why you’re saving this money, and it is for a situation like this.",
  "Yes, add up what you're paying in interest. Pay at least the 28% off. And then hope for a balance transfer promo and if there's enough credit,  transfer it and work hard to pay it off.",
  "I would pay off the credit card and have it be your emergency fund. The interest is what makes credit card debt so terrible like you said. I have zero credit card debt and I don’t buy things if I don’t have the money",
  "You’re young so you’ll have plenty of time to save again. If I were you I’d pay off my entire debt. Afterward just be smart and financial educate yourself",
  "If you keep at the rate you're going soon you're gonna have more debt than savings, sooner rather than later would be the right time to pay it off.",
  "Those are high interest/bad debts. Pay it off all at once. Right now your net worth is $600 with 9k assets and 8.4k liability. If you pay all your debt now you will have the same net worth with 0 liability and 0 accruing interest. ",
  "What about doing a balance transfer to a 0% interest card? Even if it’s only 12 months, just pay $700 a month (8400/12), from either income or savings if you have to. I’m not a financial expert by any means, but that could stop the accrual of interest while still leaving some money for a rainy day.",
  "How you rack up $8K+ in c/c debt as an 18 yr old?  Thats wild as hell.",
  "I’m unsure why this is even a question. Pay off your debt. Like yesterday. You’re never going to qualify for anything if your credit score sucks. You can rebuild your savings",
  "Absolutely.\nWhen my wife (masters in personal finance and Masters in business and accounting) moved in with me, I told her I was so proud of myself for having 12k in savings. When she realised I also had almost the exact same amount in a car loan debt, she gave me a very stern lecture on how idiotic it was to be earning 5% interest on 12k while paying 9% on the same amount at the same time.\nI didn't have the heart to tell her when I found out I was actually earning 0.01% interest because there was a bunch of different criteria required to get their actual advertised rate.",
  "Pay off everything, now-live below your means after paying off every CC you got there. Your CC would be your EF in your rainy days",
  "Clear the debt immediately. It is costing you money every month and potentially hurting your credit score.",
  "Credit card debt is an emergency. Your money is on fire. Put it out asap",
  "Wipe the debt.  You say you are afraid of an emergency, but the credit cards get you out of the emergency.  Fighting 22%+ is near impossible if it gets stacked to high.",
  "I agree with the others. Be strategic, don’t deplete your savings but try to make debts on that cc pmt",
  "yes interest is way high. pay off today",
  "Pay it off immediately and learn from it. Don’t let it get out of control again.",
  "Use your saving and CHANGE YOUR BEHAVIOR",
  "What I would do is not wipe your savings right away.",
  "Just do the math and look at that high interest rate your paying . The only way it will work is if after your debt free keep making that payment back to your savings",
  "Yeah id prob pay like 6k, so you have 2.4k balance (credit card debt left) and you leave 3k in savings",
  "You may find these links helpful:",
  "Maybe in addition to paying down a large chunk of the credit card. Not sure if it’s one account or multiple or if you’re adding more debt while paying down.",
  "The credit card company has savings deposited by people like you that they use to lend out credit for card holders like... You. They keep a cut. A big one. You're providing it. PAY THE WHOLE THING OFF. Do not build credit card debt. If this happens again consider getting rid of your credit cards.",
  "You should make sure you have a stable job with health insurance. Then you should keep an emergency fund equivalent to the out of pocket maximum for your health insurance plan. Anything beyond that you should throw at your highest interest debt.",
  "Yes, but then your lack of emergency fund is itself an emergency and you must treat it as such.",
  "Yes, absolutely. You're throwing money away. You should have been spending your emergency fund rather than credit cards. What do you think it's for?",
  "You need to pay it off. You will never get the total down with just paying the minimum. If you want to keep some savings, then keep 2K in savings, and use the rest to pay down your debt, which should leave you with 1.4K debt. Then be aggressive with paying that down as well.",
  "I’ve been around the block a few years more than you (okay a lot more) and would suggest a combined approach that others here have mentioned. It’s possible you could have an emergency of some sort where you can’t use a credit card. Also, card companies can cut you off at any time or reduce your credit limit with very little notice and you have to keep paying even though you can’t use the card anymore. This happened to a lot of people in 2008 and right now the economy is uncertain. And if you’ve depleted your cash, you could end up in a worse situation. So I would keep some in cash if it were me. ",
  "You know you're paying a LOT more money by only making minimum payments, right?",
  "You do realize if you continue to make the minimum payment, it can take you up to 10 years to pay it off and you will, in the end, end up paying around 15,000 or more total? ",
  "Yes, pay it all off, then try to build 1k savings.  you should pay off your credit card every month.",
  "What in the hell are you doing, running an 8K balance on your credit cards at 18?",
  "8.4k is pretty wild at 18 but you could just kill it. I know it’s scary but I did something similar not too long ago, it sucked putting such a big dent in my savings but the projected time to pay off my credit card was a lot. ",
  "Yes. You're paying way more interest on that debt than you're earning on that savings account.",
  "Absolutely do not wipe your savings to pay these off. You should always have a couple grand available if you need it.  You can use some of the savings to make a decent chunk, maybe use 4K or something. Try to budget so you have extra cash to throw at it, start with the higher interest rate first. Then after that one is paid off focus on the other card. ",
  "Yes, but you need to stop using credit as much while rebuilding that savings.",
  "unless the interest on whatever savings account you have is 29% it makes the most mathematical sense to pay off the credit card debt instead of holding onto money you don’t really have. like other comments said- your credit cards can act as your emergency fund until youve built that back up",
  "I can’t imagine making $15k–$30k at once… how do people do it?",
  "Selling my small business in 4 week... so scared to tell my employees",
  "Please Don’t Let These AI Crooks Take Your Money",
  "I freeze on sales calls. How did you get better?",
  "Here is a real look on where my customers come from and what my takeaways are",
  "Is there something like a shark tank but for even smaller businesses that just started and have patents?",
  "What’s the best way to scale cold outreach without overwhelming the sales team?",
  "Water mitigation company",
  "How do I level up?",
  "Gym Interview Tomorrow",
  "What would you do ?",
  "Email Provider for 1-Person SMB",
  "Need help improving my backend automation offers",
  "Starting a laundry business",
  "Should I sell??",
  "Cold calls or cold email?",
  "What’s everyone using for a basic POS or cash register setup these days?",
  "Learning How to Analyze Small Businesses",
  "Need Advice: Saturation killing my ideas",
  "I want to quit my job and focus on my small business. Advice?",
  "realistic Roleplays for Cold/Discovery Calls for sales",
  "Looking to connect with other new business owners",
  "Is Sales Navigator a must for lead gen?",
  "Question about LLC Finance",
  "Microsoft ‘Business Assist’?",
  "Military Surplus",
  "From Brick & Mortar to Ecommerce??",
  "Sewing Small Business",
  "This is a friendly reminder that ",
  "Think about value. I always think about things this way, if a company has $100 million dollar problem, they will likely pay $10 million to solve it, and the company solving it may profit $1 million on the $10 million. ",
  "That first 50k cheque's is pretty crazy to cash. ",
  "I once heard \"you don't get paid what you're worth, you get paid how much it would cost to fix things if you screw up.\"",
  "You don’t make $15-$30k just working by the hour or salary. You make that by either having such a highly specific skill that someone is willing to pay you that (weekly, monthly, w/e) or being a middleman and brokering business deals between 2 companies and taking your cut. 2nd way is muchhhh easier and can be achieved much quicker than the first.",
  "I think it depends on the transaction, right? The plumber might make $500 a day, but repeat this over and over and over. I might profit $30k on a remodel, but only every eight weeks or whatever.",
  "Seems like what you’re sellling must be fairly low value?",
  "I think it is industry as much as anything. I’ve had financial services clients whose quarterly invoices were that sort of figure. ",
  "My first check from my first client was for $16k, I’ll never forget that moment. ",
  "We'd do $12K sales on a single day at my old bar & grill. Then my later tech company sold an enterprise system averaging around $400K per sale (highest was $2M). Just depends on the type of company and product/service you offer. ",
  "Most likely a change in mindset.  Depends on what you're selling.  I'm a contract software developer.  Over the years I have developed software and processes that have saved my clients millions of dollars which makes me think I might not be charging enough.  I've done projects that literally replaced full time positions (don't worry nobody got fired, they just moved the personnel to other positions).",
  "You don't get there alone. You may GROSS 30K but you net 5",
  "I just submitted a proposal for 64k to a client, I'll take home 30k from the project.... Assuming nothing goes wrong. ",
  "If you are in sales (and we are all in sales)iIt takes just as much effort to close a $500 deal as a $15,000 deal.",
  "Well if you sell t-shirts and you're selling them individually you'll never sell $15k \"at once\". You might clear 15k per month after selling 600 shirts for $25 each. ",
  "Bro it took me a while but part of it is getting out of that hourly mindset. ",
  "This is going to be dependent on the type of business you own. ",
  "Not sure about services but I'm actually from the SaaS industry",
  "I had $20,000 hit my account all at once and it felt amazing.",
  "I mean I have done a few contracts where the job is a million dollar plus. Now that’s a project that takes a year or two to complete. But eventually when you start dealing with jobs that big they turn into just a number.",
  "Yes, partly. Because as the saying goes: ",
  "Depends on the business! My \"large\" transactions are $1,000. But to get my space prepped I paid my contractor like 600k (in 20-70k chunks). He has way fewer transactions than I do. ",
  "I don't think you can or should compare absolutes like you are. At corporate life currently, we wouldn't even look at contracts under 7 figures and most likely want 8 to make it worth our time. You could buy a Lamborghini or one of our specialty items for roughly the same price. ",
  "You get used to it as the numbers get bigger. Expenses tend to get bigger too.  100% need to be in the right business. Some bigger businesses yawn at million dollar deals. It’s all about scale.",
  "Honestly.... it ruins business. I hate doing smaller projects now. When IRs were low, mid 5 figure checks were common for me. Now its low 4's.... FeelsBadMan",
  "I had a business that could get tickets as high as 100k. I also have had businesses that you would need thousands of orders to make 100k. Pros and cons to both. ",
  "Just finished a commercial office build out. Total project $200k, I cleared $56k.",
  "Frequency matters.  30k twice a week is very different than 30k every couple weeks.",
  "It really comes down to value and appetite for risk.",
  "What does your marketing, emailing, website, product pictures, etc. look like? Are you sending the right message to the customers you want to attract? Just because you might not spend that much at one time doesn’t mean there aren’t people out there who will.",
  "First millionaires of the Gold Rush were not the diggers but those who sold them shovels and picks.",
  "Its not that crazy for me to make a sale that large but I only personally keep like 40%. So it takes alot for me to be really excited",
  "I make around 11k a month but also so boring so it just sits there. 🤷🏻‍♂️",
  "Would say more than half the time they are playing the D measuring ego game and talking revenue, not profit.",
  "I build energy management systems for Battery’s and microgrids. We can make $150k on a project. I don’t feel like it is that much though. Been in business since 2017 and I still feel like I’m struggling. Matter of fact I’m looking to raise money now",
  "I think it depends on industry as you mentioned. My wife owns a women’s clothing boutique and grosses about 60k a month and nets about 25k",
  "I have done $35k a day, but only twice, in affiliate marketing.",
  "Commercial jobs and contracts. Government bids. Some companies have unlimited money.",
  "Depends on your industry and what you're selling or doing. I renovate office spaces. Most of my contracts are between $750K and $10M. A 10% profit from those numbers is easy.",
  "When you run your own business these transactions just become normal plus you have fixed and variable costs throughout the year so it typically balances out annually to a salary plus profit. Also once taxes are deducted 15k in one go is really circa 7.5k.",
  "Slow and steady growth. There are rare examples of people who manage this kind of thing quickly without burning out. But most people don't have the infrastructure or bandwidth to deliver the sort of customer experience you need to after that to keep momentum going. We have several days like that per month at our shop and days that are significantly higher than that during the Holiday season, but it took several years to get there. But we've grown by almost 100% over the past 12 months and, even after being in it for almost 20 years, our systems and infrastructure weren't ready for that sort of rapid growth.",
  "Sure, but if i spent 3 months doing it, id still be techically at 5k a month",
  "It’s a mindset. Depending on who your IC/TM is, offer pricing tier packages. The top tier package should be a ridiculous number, even for you. You’d be surprised who pays for it.",
  "$100k just to build a pool, spa and a slide these days.",
  "My AC guy quoted me $20 k to put in a 2 ton AC unit ~ $2 k. So he trying to make $18 k in an afternoon.",
  "It's $15K revenue. After paying costs (variable and fixed), the profit is much smaller.",
  "I used to sell to cruise ships... maybe 2 it 3 times a year but each time could be between 50 and 200k... the key here was not blowing it lol..",
  "People don’t “make” 30k on a project. That might be their work for 2 months and profits need to last 4 months.",
  "Just depends on what you do... I made 15-20k for now which is just going to keep growing cause I stay consistent with my business. ",
  "Seeing it can shift your mindset massively. I noticed in the digital marketing agency space, almost all the successful owners had been in a previous successful agency as a low level employee in the past. It took me years of hearing about it happening and through trainings to even conceive it possible and baby stepping like a lil bitch before it happened. It didn't need to take that long and I lost a lot of momentum starving for cash flow due to it. Get there as fast as you can before you burn out.",
  "Construction- very common",
  "You prioritize your best customers and phase out the worst. I don't even bother with $15k projects anymore, you can't grow to something big at that price. I now work with enterprise only where they understand nothing costs 15k. 30-100k is the norm now for a 2-4 week project.",
  "This is a friendly reminder that ",
  "I would not break the news before closing. For example, if 30% quit he has basis for re-negotiating or delaying the deal.  ",
  "Imagine this guy has no real intention to buy...",
  "FFS no. Employees find out after funds are wired and it's a fait accompli. This is absolutely standard.",
  "Dudes trying to crash your business so they can swoop a cheaper price.  Absolutely do NOT do this.",
  "Please DO NOT tell them until papers are signed and the sale is complete!! A friend of mine was in the process of selling their business, told the employees before closing, they all quit and the buyer backed out. ",
  "This is uncommon to make a full announcement pre close in small business M&A. You usually tell a few higher ups quietly and let the buyer interview around this time in the transaction.",
  "I have went through this exact scenario several times and I would absolutely NEVER tell them 2 weeks before the sale closes. Nothing good comes from that..",
  "I went through this twice as an employee, once with a small business where the owner told us and once with a large business where we found out after the sale. From an employee perspective, the small business sale was more uncomfortable. Because he had told us prior to the sale being finalized, we had no concrete direction or plans - everything was a “guess we’ll wait and see.” It frightened a lot of employees.  ",
  "I wouldn’t tell them until the deal is inked. What benefit is it to you to tell them before?",
  "That's interesting.  Our broker told us the norm was to NOT tell the employees until the sale was final.  That worked well because instead of \"I have decided to sell\" and the possible questions seemed more risky than \"I sold\"",
  "Seriously?   There should be a whole comms plan agreed with the buyer that occurs right at close.   Typically critical employees offered retention, managers prepped and told first and armed with FAQs for staff, then general announcement.  ",
  "I worked for a company that announced their sale. I left shortly after, with a couple others and we all took a pay cut. About a year later, we found out the owner of the company we moved to was in talks of buying out my old company. Owner never sold. Buyer backed out after we all left and worked for him. ",
  "I work in m&a for 20 years and have done deals big and small from public  deals to 50k mom and pop asset acquisitions. ",
  "I run a firm that provides financial due diligence services to SMB buyers, so I’ve seen this exact scenario ",
  "Wait until the deal is done. When you do it hold your head high, you worked hard for this!",
  "Been there .    Sold in 2020 and we told employers … buyer bailed day of sale - we were fortunate our employees stayed.     Sold again last year and didn’t tell them u til 30 days AFTER the sale.  New buyers hired all of our people and a year later all is well.      Hindsight says never tell them pre sale but for us it all worked out.",
  "I sold my business just over 2 years ago. I had about 140 people at the time. I completely understand why you feel like you do it. It isn't a nice feeling. I felt a huge amount of guilt.",
  "Just to clarify; they’ll have to report to the new owner or do they lose their jobs because he plans on bringing his own teams in?",
  "95 employees is not particularly small and I’m guessing the sale price runs into single or 2 figure millions. Are there any retainers and/or bonuses going to any of the 95 employees that have helped you build that business up?? Either from the buyer end or from your end?",
  "Don’t tell anyone anything. It’s your business not theirs…. Literally",
  "Absolutely do not tell the employees in advance of the closing.  If for some reason the sale does not close you will lose employees because the minute you tell them about selling the company a good number of them will start looking.  ",
  "You need to be talking to your lawyer",
  "Tell the buyer to pay you 50% if he wants you to tell your workers 2 weeks before. At least he won't back up.",
  "Frame it as a new chapter, not an ending.",
  "What are the contract terms surrounding staff retention by the new owner?",
  "I just closed mine as of Monday, next. I have one employee, new owner is just absorbing mine and agreed to take my guy on. I’m not telling him till Monday.",
  "Keep it quiet until the sale is final.",
  "General consensus is you should not tell your employees prior to close. You tell them the day the deal closes, then immediately have the new owner come into the room and give their speech. ",
  "Do not under any circumstances tell all your employees you are selling. ",
  "The buyer wants you to tell them so he can meet them to make sure he wants to close.  I would strongly advise that you not tell them unless you absolutely have to.  And even then, I would limit it to your senior management team, if you can.  Of course, news like that does leak, so be careful.",
  "Absolutely NO REASON to tell employees about a sale that may or may not close.  That is something the new owner can do post close.  You can/should offer to stay for a transitional period to smooth it for both new owners and legacy employees.",
  "Don’t do it, you’re a good person. But this is the moment you need to protect yourself",
  "I did it once with smaller company i guess.. i told them before the agreement was done, and 3 workers left the company, then the buyers thought about cancel.. what im trying to say- you have to think and care first about yourself",
  "Wait till the deal done and you have the cash on hand. Until that happens you risk losing employees and messing up the deal.",
  "Never tell them until after the closing. The buyer will screw you",
  "Don’t say anything unless you want to blow this deal up",
  "Do not tell them!  Cannot stress this enough.   ",
  "Best case for buyer is that the day you sell, you introduce them as the new sales rep. After a month of them working in the business, you tell everyone that they bought you out and they are in charge now.",
  "I have 92 employees and am coming up on the same situation. Super anxious",
  "I’m in M&A and buyers always push for early announcement and I never understand it (it doesn’t make sense to me from either side’s perspective). For the reason others here stated, you should consider holding off but work with the buyer on the  plan for announcement and post-closing integration. Totally understand the hesitation.",
  "NOT a good idea",
  "Sounds like you might not actually be selling your business if this is how the buyer is operating",
  "Do not let employees know in advance before the deal closes. After the close explain to them why you decided to sell the business and why you selected the new owner to carry the business moving forward and why this is a positive for them.",
  "You dont have any obligations to tell, nobody can guilt trip you since you are the creator of your business..",
  "Until the deal is done, nothing shock me said.  They are buying the business. Best to keep it intact.",
  "Do not tell them until the deal is closed!",
  "I've just been through this from the other end, ",
  "No money no honey",
  "Do not tell them before you close. DO NOT.",
  "Did you write anything into the contract that new owner would keep current employees on until x date?    If not and he’s going to can them all, then it’s pretty sleazy not to tell them.",
  "You're dumb for listening to the buyer lol its still your business, tell the employees now if not you are a shitty owner",
  "You need to tell people so they at least have time to look for another job. You might be scared but you have 95 people whose livelihoods are depending on you and you'll be screwing over if you sit on this.",
  "LOOSE LIPS SINK SHIPS",
  "Honesty is the best policy.  ",
  "Your employees will fuck you if you tell them.",
  "Absolutely not until after closing.",
  "Advice. Go to doctor and get some propranolol (beta blocker). Take 3-4 1-2 hours prior to telling staff. Your concerns won’t go away but you will handle the event better.",
  "Golden parachute for you and the high ups? ",
  "I went through this. I assumed that no one would be able to properly empathize or understand the sacrifices my co-founder and I had made to set them up for success. I was right. It was mostly complaints and very little gratitude. ",
  "Don’t break the news before selling. I’m in the process of selling my business and the buyer backed out a week before closing even though everything went fine with due diligence so I would strongly advise not to tell your employees..",
  "You business your life congrats",
  "This is a friendly reminder that ",
  "AI agent is pretty vague. What you're describing sounds like a GPT in ChatGPT, which is definitely not agentic.",
  "You’re not wrong. I’ve had a few marketing folks pitch me on these “custom AI agents” and when I asked for details, it was just a GPT with a prompt that says “act like a receptionist.” ",
  "To be fair (and I’m not selling AI services), it’s a bit more nuanced than what you’ve described. ",
  "AI Agents are software. ",
  "Your site sucks",
  "give us an example. what’s something you’ve done that people are charging money for?",
  "Should have used GPT to make this post better, what exactly are you on about?",
  "Maybe you should use AI to make your site pop",
  "Brah they even have no code AI …..",
  "There was the AI hype. Now we see the ai agents hype which is not for everyone.",
  "You have a misunderstanding of what AI Agents they are selling. I assure you actual agents that have integrations are not just \"a couple paragraphs of plain text\"",
  "AI is a poker machine for workaholics. People sit there endlessly 'prompt engineering' - teaching themselves pseudocode so they train ChatGPT for OpenAI and paying for the privilege.  They're obsessed, despite it being clearly terrible, because it makes them feel good. They love AI agents because it feels just like you're micromanaging a big team that always does what you say. They always competed on how many 'reports' they had under them, now they can just click a button for a new agent. That's why companies that offer Agents are making a killing right now without ever proving validity or reliability.",
  "Deep Dive into the SMM Panel Industry’s Secrets from a 10-Year SMM Panel Owner – Best & Cheapest SMM Panel? Oldest SMM Panels? First SMM Panel & Biggest SMM Panel | ASK ME ANYTHING",
  "Instagram seems like it’s a dying platform. I have a business.",
  "How do you guys keep up with social media updates without feeling completely burnt out?",
  "Social Media Manager Wanted",
  "Social media intern interviewed at a real estate agency",
  "META Structure for Campaigns, ad sets, and ads",
  "🚨Looking for Reddit & Discord Mods! 🚨",
  "Meta Disabled My Facebook and Instagram Accounts Over a False Accusation—All Because I Asked Meta AI to Analyze a Video",
  "A Hard Pill to Swallow as a Social Media Manager",
  "I want to start a business. Should I use Social Media as a marketing tool or should I focus on quality content and word of mouth?",
  "Need followers for any social media platform? (The best way to increase reach)",
  "Freelancer social media managers do you actually get clients from Reddit ?",
  "What features or trends would you revert to start really using social media agian?",
  "Getting Started on TikTok: How can I figure it out?",
  "Hey creators! Would you use a tool that makes handling brand deals way easier?",
  "Raising Awareness About Unauthorized Recording of TikTok Livestreams",
  "If you’re running social content but still not converting, try this",
  "What's your 'post and pray' metric that actually predicts virality?",
  "Is it better to post daily or focus on high-quality weekly content?",
  "Archive Site for Twitter and X",
  "Would you find it useful to track your competitors on social media?",
  "Need help with quora",
  "Facebook pages not showing",
  "What’s the worst Instagram advice you followed that tanked your reach?",
  "Cuál es la Dimensión ideal post de Instagram?",
  "I fund artists without a label. Built a network of financial partners to do it.",
  "Need Help - confused on authenticity of Alqabas on IG.",
  "🎯 Offering FREE Social Media Management to Creators – Just Want Experience! 💻📱",
  "If this post ",
  "yeah indeed we use morethanpanel and smmraja for our smm panel as reseller and far more better from other smm panels so far. But what about twitter provider mate. any advice?",
  "What Dmytro Chumak said is something most people active in the field are already aware of but rarely talk about. The expectation that “one panel should solve everything” is quite common but it’s just not realistic. Every panel has its strengths and weaknesses. Some do really well on YouTube, but completely fail when it comes to TikTok",
  "Dmytro, our senior in the industry has truly earned his retirement :) While we’re still rookies he’s already been shaping the sector with his tea and coffee in hand What he says is rock solid true If you stray from his advice you’ll get smacked by the industry — that serious  Especially that part about 'find your niche work with quality and big panels' — that’s a real 'master’s advice'  Honestly this field is such a bottomless pit the more you try to work broadly the deeper the pit gets  Step by step moving steadily is definitely the smartest way",
  "If this post ",
  "If Instagram is dying, my question is: what is well and alive? \nAlso - I do think that Instagram does many things on purpose, such as limiting posts’ visibility, to “gently push” people to pay for visibility.",
  "Meta is a dying platform honestly. At least it somewhat feels that way.",
  "engagement on instagram has really dropped lately. lots of people are seeing low likes, and barely any comments, even with big followers. feels like the algorithm has changed or people are moving on.",
  "If you're running a business, it’s worth shifting your IG strategy:",
  "That only means those pages bought thousands of fake followers. It’s actually one of the best indicators for spotting whether a page’s followers are legit. If they had 30k real legit followers, each (good) post would easily get a few hundred to over a thousand likes.",
  "I agree. I’m a hair away from deleting. On my personal page, seems like nothing but ads. Or it’s the same post from the same follow (lame) my biz page, where I follow businesses is also lame…",
  "TikTok is growing faster every year.",
  "Those examples of large accounts with low engagement are definitely concerning. It makes you wonder what's going on behind the scenes with the algorithm and who it's favoring.",
  "I'd say it's been dying for a while, as my account has had zero growth for years (I gain and lose about equal followers). And engagement and everything has been getting worse and worse. I used to get hundreds of likes per post, then I was lucky if I'd hit 100. Now I'm lucky to hit 30 - and that's with over 4k followers.",
  "It has most certainly been dying and 2025 has been like no other. Having working in the social media space for over a decade with millions of followers across many platforms, Instagram in 2025 is now heading towards the same ‘pay to play’ strategy as Facebook did around 2016/17. Organic just isn’t working like it used to, follower count aside. Content that resonated with the audience is no longer being served to them. 2025 is really becoming the end for Instagram organically.",
  "It was bought because it’s competition. The algorithm favors paid profiles and throttle anyone else. I went from having Carrie Underwood’s drummer Garrett Goodwin commenting to a ghost town. Can you imagine the legwork I would have to do to get my stuff in a famous musicians feed again?",
  "You have to consistently post good reels to get reach and engagement on Instagram now.",
  "Regardless of whether it is dying or slowing (which it isn’t) it’s still one of the most looked at apps on every phone. ",
  "The only reason I keep my account is my business. Just so people know that I’m still operating so I post once in a while. Lot of the content there is just aspirational which I haaate. Bad vibes everywhere.",
  "Wouldn’t say it’s dying, but attention is definitely fractured. People scroll more than they engage, and most of it feels aimless. But at the same time, people are getting better at spotting what’s real and what’s just noise.",
  "I don't get anything on IG or threads anymore",
  "HI! I'm building SaaS for Threads (meta) and seems Threads is on its big wave..! While building the service, I gained more than 8,000 followers.",
  "what business you are in?",
  "People want to see “real” content now. No touch ups, symmetry etc etc even for luxury brands owned by celebs 😅 There’s a shift happening where people lying in hoodies in bed starting their videos with a good hook holding a mike in their hand has a far better impact than cool transitions and rehearsed speeches. I can feel that shift in me as a consumer too. When it comes to pictures, people want to see the product or service in action. “Lifestyle pics” :) Also - Pinterest isn’t a dying platform so maybe try that if ur selling products.",
  "OP is a bot",
  "Lol - bot",
  "Anyone who works in the industry will probably tell you that Instagram is the cornerstone of their social media. For example, one of my clients has a total following of around 30 million, of which Instagram is only 10% but has contributed ~60% of engagement and video views year to date.    ",
  "Instagram algorithm is a course on its own. If you don’t keep up a popular account can gradually disappear into oblivion.",
  "Yeah it’s dying and has been dead for me for a year or so. My content is very good (I know you hear that a lot ) and I believe in it. I have tried growing in Insta so hard for couple of years but as I grow lesser views, lesser interaction. I was getting better engagement when I had 200 followers vs 2000 followers. I make a bee high quality travel content that I work really hard on. I was getting to the point where it was affecting my mental. So I decided to completely give up on it couple of months ago and try to grow in Tik Tok instead.\nBest decision ever in my life. Two months later in tik tok . I am pulling in almost million views per week. Got to rewards program and was even able to land few good collabs. I have about close to 30 legit collab  requests in just past 2 months. I just regret I wasted so much time in shitty Insta app. 2 years .. if I had given that time to Tiktok I would be probably at 100k followers in Tiktok.",
  "meta just reported blowout earnings report and the stock shot up",
  "Big followers with very small likes has typically meant the followers were bought",
  "It's sort of hard to say. My Instagram account has 72,000 followers. Nearly every day I have a post get 1000+ likes. But other posts only get 200-300. It feels like I'm getting about half the engagement that I did a couple of years ago, when I'd regularly post content that gets 2000+ likes.",
  "X is booming",
  "now is the perfect time to invest as much as u can into instagram so that you can build a platform and understand how to navigate the platform when it comes back",
  "It’s not about the likes. All about the send as Dm and saves.",
  "People hate being advertised to- what a concept.",
  "From a business perspective, don’t stress about whether a platform is “dying” that mindset only matters to people chasing influencer status.",
  "I thought the same, until recently building a community based business that has quickly blown up. Only around 4,500 followers and average post gets 400-500+ likes and 200+ shares. Around 200k monthly impressions just by posting a few times a month. ",
  "It’s not dying just a Business as you follow don’t get any shares because they don’t add enough value to their audiences.",
  "From my perspective:",
  "I truly believe it’s because of a.i, ",
  "Instagram is slowly but surely dying and this is a fact. I switched my brand from Instagram to Tapkeen and I am more than satisfied with the decision",
  "I agree but I also think it’s because we all have this opinion and none of us engage with each other on there anymore!",
  "anything facebook is toxic, look east my friend",
  "I have a 75k account and average 3000 likes and 100 comments per post.",
  "Because IG is awful. You get caught in some BS, AI wheel that restricts you for nothing. Once you're caught in that wheel, you're basically fked. I got restricted for 10days for asking when a band was going to tour.  There is no recourse unless you've got 10000s of followers. \nShadow banning is bollocks.  You can not have any decent dialogue anymore. ",
  "Tell me the accounts you’re talking about and I’ll tell you exactly why they have 30 likes",
  "Definitely not dying. It's just fundamentally changed as a platform over the lastr five years and most accounts struggle to understand 'new instagram' and I am guess the contant of those accounts is simply not engaging! I have two businesses and have grownt them faster than ever on Instagram in the last yearl You just need to know how to work with the platform now. I passionately believe it's the best platform for businesses in 2025 and I'm not just saying that. Most people just don't know how to use it.",
  "Instagram is dead. Zuck doesn’t get enough hate for what he did to FB and Insta. The platform is just teens making fake content - affiliate marketing scams and dropshipping scams and fake money posting, course sellers and grifters and annoying red pill content and anti trans shit and Russian propaganda. There’s no regulation so it’s all fake.",
  "Fake followers. I have 4.1K followers and get 500+ likes and 60+ (I respond to everything so technically 120) even had one with 200 comments and 1.2k likes. Stories are something else though. I sometimes get 1400 views, sometimes only about 300 for some reason.",
  "I think it is… I hope at least. The whole Meta verse makes me cringe.",
  "Since all of the Social Media platform interactions are infested with \"AutoBot Influencers\"... Ladies and Gentlemen, Humanity has left the building! I remember, back in the day, when Social Media was a platform for actual human beings to share ideas, activities and current events for HUMAN consumption and discussion. Yep... Those were the days!",
  "You can't rely on one source of exposure online. You need to build your brand across multiple platforms and use SEO, AdWords, Social. You need people to see your brand pop up in different spaces with different approaches depending on the audience. Social is very pay to play these days as well. Organic reach is mostly dead.",
  "They do whatever they want. They limit visibility, they push propaganda with their algorithms. There is noone controlling them. To this day I do not understand why EU has not banned all meta platforms exactly because of this. They are used to undermine EU from inside and push narratives that they want. Stupid EU sitting doing nothing, judt watching.",
  "Maybe those are paid followers = High follow count, no interaction.",
  "Short attention spans now. People have no time to comment anymore. Really sad to see how things are going with social media.",
  "There are tons of successful businesses on Instagram but if you aren’t adapting to be reels-first in 2025 you are going to fail, I see businesses on my feed all day on Instagram who have crazy high likes and views in comparison to their following. I also work with many brands making thousands to millions from Instagram posts and ads.",
  "They simply don’t actually have that many followers, lots of businesses buy followers to make it seem like they are popular when in reality they aren’t. Instagram is well and alive",
  "Yup. And it's frustrating because now that I want to be serious about IG for marketing my business, I'm expected to pay for visibility. 🙄 But back then when I wasn't trying, I got so much engagement on my posts for free. I was getting well over 30 likes, and I was getting frequent comments and shares! But yeah, now IG is a dying platform that only prioritizes influencers with millions of followers. This heavily hurts small businesses and artists that don't have the money to pay for ads daily.",
  "Welcome to the old internet",
  "Most accounts on Instagram are filled with fake followers anyway.",
  "Instagram's organic reach has dropped a lot, especially for business accounts. A lot of those follower counts are inflated from years of giveaways, bots, or inactive users, which explains the low engagement.",
  "I was using an app to get followers but instagram discovered it, so my account got shadowbanned. Maybe that's happened to the accounts that you follow",
  "There are no alternatives so use it or lose it - and lose out. It's that simple",
  "It's always been... unless you're a nation wide brand, marketing on social media is virtually pointless. A good website, with good SEO, and paid outreach is much more valuable",
  "I will say I’m more careful about what I hit like on because it’ll be shown to my followers. Get rid of that and the likes will come back",
  "I agree re Insta. I spent a lot of time building up 10k followers for our book business on there. Back in 2019/20 I’d get 500-1000 likes for posts. That started to die off slowly to double figures and now I’m lucky if I get 10 likes. Which is why I no longer bother and have built up an engaged following on TikTok and X instead which brings plenty of business.",
  "I never really thought about it, but yeah it is dying.",
  "well who is your market audience? you have to treat these platforms as different personalities; viral posts on instagram could do absolute crickets on another app like tiktok.",
  "I agree. Even accounts with millions of followers arent getting that much engagement so either they bought followers or engagement is down",
  "If this post ",
  "Simple just don't.",
  "I didn’t know we were supposed to be doing that. No wonder you’re exhausted. I just go look at social media to see what fun is out there. I don’t actually take it too seriously. I like the news part of it just to keep informed of what’s happening in the world. I don’t take that too seriously either usually everything keeps changing. Nothing stays the same. What’s down tomorrow will be up today and vice versa like a big old circle.",
  "Life is more important than social media. Thats a lesson I’m learning right now.",
  "If someone is making a \"you're late if you haven't (xyz)\" or \"do these top trends\" video about it, it's already on the downswing, you can see that from the recent GPT Ghibli photo trend. In the weeks after there were so many posts and videos about that shit.",
  "This is so true! Sometimes, the best way to keep up is to step back. I've found that giving myself dedicated 'no social media update' time, or even a full day off from tracking trends, helps prevent burnout.",
  "I think I spent the first two hours of the morning just checking everything. All the socials, all the Youtubes, all the news developments, answering emails, texts and DMs...",
  "Do therapists keep quiet because they don’t know what to say?",
  "Is it weird that I’m fascinated by very basic, human-level things about my therapist?",
  "How do I find a therapist that won’t try to “finish” therapy?",
  "If a parent regularly (daily or near daily) yells at their child, does that meet the definition of verbal abuse? If not, would there be a better way to classify that behavior if it isn’t verbal abuse?",
  "I have this friend. He’s been going through stuff. He has very low confidence but not low self esteem. Is there anything this could generally indicate?",
  "Worried about my spouse, what to be looking out for?",
  "Cuddle therapy?",
  "Looking for the best online therapy sites. Any recommendations?",
  "What does it mean if as a child I told my parents I was a ghost?",
  "Supplement recommendations to manage stress and body trauma responses to returning back home for summer?",
  "How long does it usually take for a therapist to get a broad idea of your problems?",
  "Do you enjoy when clients message you outside of session, or resent them?",
  "What psychology/counseling techniques work best (or quickest) to reveal repressed or hidden trauma for mature adults?",
  "Can I give out my personal email as an intern?",
  "Is distracting the brain good for rumination? Instead how can I just get over the thought?",
  "lost access to my therapy, good alternatives?",
  "Can I ask my therapist to snack during sessions (virtual)?",
  "Ethical question?",
  "Is long-term therapy always the client’s decision? Assuming pay is not an issue, are you ok with seeing your clients/patients long-term for many years?",
  "Is a therapist required to report another therapist?",
  "Why do people self diagnose themselves?",
  "Can I still see my therapist when I move for college?",
  "How do I save time in text therapy?",
  "Psychologist from Belgium – how do I build an online caseload of private clients (EU or international)?",
  "Questions/Concerns from an Upcoming Therapist?",
  "Can therapy help me?",
  "What do you think about a friend attending a session with a borderline patient? Helpful or not recommended?",
  "AI Companion?",
  "Sometimes, but I typically communicate that I’m just taking a moment to process what they shared or if I need extra time to process clinically and come back to the subject matter the following week. However, depending on the diagnosis, sometimes I will use silence as a tool for people who feel compelled to say literally anything because silence makes them feel awkward. So it’s a case by case basis. I would recommend telling your therapist how you feel about it though! Don’t be afraid to speak up about how you feel, that’s why you’re there. It can lead to a great discussion about it 😊",
  "What you're describing ",
  "Some forms of therapy essentially put the ones on you to delve deeper yourself; that's what using silence as a tool is. The expectation is that if you want to go deeper, you will. ",
  "I had a therapist who did this so often that I began to think she was doing this so that she’d have to do less therapy work. This was in a group setting. Sometimes the silence would go for as long as five minutes. She did this several times per session, it really wasted the time we had per session.",
  "There’s a really specific way to use silence. And it can be extremely powerful. \nAnd then yes we are human. Sometimes we don’t have anything to say. Sometimes we sit in the moment with you. But I do think it’s important to not just walk passed that moment completely",
  "Gonna answer this for myself. Yes, sometimes. My brain just doesn’t have anything. Usually I’ll name that aloud after a bit though. ",
  "I actually HATE the \"silence used as a tool.\" It feels wildly condescending to me as a concept. Thankfully my psych doesn't do it but I would quit one who did, the fact the therapists' sub is such a fan of it blows my mind.",
  "“The truth is, most of us are terribly afraid of silence. Because silence doesn’t let us hide.”",
  "Haha no. I do understand why you might wonder that, but our job is to help ",
  "Ask then why they're giving you the silent treatment. You aren't a mind reader. You are paying for a service.",
  "The “blabbering to fill silence” is part of the process (at least in psychoanalytic/psychodynamic therapy). The whole concept of analysis relies on free association to uncover parts of your subconscious and bring them to your conscious awareness.",
  "I kind of try to operate by WAIT - Why Am I Talking?",
  "it doesn’t always apply, but in grad school once a professor asked the class “if i ask a question, how much silence does there need to be for each of you to raise your hand to answer?” and for me it’s like zero time lol, but for others? could be as long as 30-45 seconds of silence for them to answer. it’s not a direct comparison, but it does make the point that some people need more space before volunteering information, for all kinds of reasons.",
  "I have suspected some of my clients are like this! I once mentioned I was taking a week off to go on a craft retreat and a couple of clients got SO excited for me. \nIt makes sense, I get to hear all about them and all of their things, I suppose it feels nice to be let in on the reverse.",
  "“I’m like a little truffle pig” \nThat comment right there wins the day. And yes me too. Every new thing I learn is like winning the lottery.",
  "This is so real. My therapist hates Subway and I feel special for knowing this completely random, unimportant fact about him 😆 ",
  "I have an Instagram page that is fully a kpop fan page and I can’t wait for the day that one of my clients finds it, haha.",
  "As a client in therapy with the same therapist for over a decade… I feel this way about my therapist! Every time I learn something about her I feel like I bank it in my brain to get a little better of a picture of who she is outside of therapy. ",
  "Not at all, you're opening up to them and it's natural to have a curiosity about their life. Therapy is relational. Your simile of a truffle pig made me laugh!",
  "“I’m like a little truffle pig” \nThat comment right there wins the day. And yes me too. Every new thing I learn is like winning the lottery.",
  "I used to feel the same way about teachers in school. Mostly people I admired or had a crush on(even if I didn’t know it at the time). It feels like you’re getting to know them. I guess in terms of therapy it can be a nice change since they know all about you, specially your most intimate thoughts and things you have done. So I guess it feel refreshing to know a bit about them too.",
  "\"I'm like a little truffle pig on the hunt for new information\" is not a phrase I thought I'd ever identify with so intensely but it seems I do. Always on the hunt for more Therapist Lore.",
  "I understand this so much! My therapist self discloses (appropriately!), and over the course of 2 years, I've picked up the nicest little glimpses into his life. These small glimpses really help me to understand that I'm not alone and that his care comes from who he is as a person, not just his role as a therpiast.",
  "Yes, but only about this one counselor I really connected with. I had crisis counseling after another sexual assault and she advocated for me to get 25 sessions instead of the normal 10. She was in  the midst of getting her masters.I'll never forget how much she helped me. She was the one who helped me get a psychiatrist which led to my diagnoses of GAD, OCD, ADHD, and PTSD. I remember her full name, her orange tabby Andrew, her pretty blond hair, how she hugged me after our last couple sessions, her love of amethyst, crochet, and arbutus trees. She was the best.\nI check out her linkd in profile every now and then to make sure she's still practicing. Maybe one day when I can afford it I'll reach out lol\nIt's an ironic blessing that I can't get in touch with her for free because I'm no longer in need of crisis counseling thanks to her help 💚💖💙",
  "It's normal. I don't gatekeep information like that about myself as a therapist. I don't mind sharing where I grew up, whether I have pets, how I like my coffee, etc. I have the same curiosity about my own therapist, and she's not weird about it either.",
  "I used to do this with my teacher, I think it’s a thing of “I trust you to know everything I’m struggling with so I want to feel like I know you”",
  "Not strange at all! Only natural!",
  "We are people was that me at giant looking homeless yes it was. Was that man I was with my husband yes that was",
  "I had a conversation about business with a bar manager and a bouncer once at a bar ",
  "I don't think it's weird at all--one of the cues for self-disclosure is self-disclosing yourself, so since you're doing it all the time it can feel weird that your therapist isn't.  I'm fairly open with my clients and don't mind questions--I'm not a psychoanalyst where the blank slate is part of the therapy--but I do make sure my self-disclosure is in their interest and not because it's fun for me to have someone fascinated by what I'm saying about myself!  I do feel weird if a current client Googles me or looks for stuff about me online--that feels like an invasion of privacy, and as I don't ever do that with clients I don't want them to do that to me--but I don't mind people knowing bits about me if it's helpful for them.",
  "look into therapists that practice long term modalities! some examples that come to mind from my own personal & professional work would include therapists that practice psychodynamic, somatic, parts work, experiential work in general. ",
  "NAT but try looking into someone who takes a psychodynamic approach",
  "Yes, I agree that someone who works psychoanalytically/psychodynamically or other depth modalities may be a good fit for you.  It’s possible it may be challenging to find someone using insurance, though, since sometimes insurance pressures are for fewer sessions that address current functioning and symptoms, rather than doing some of the deeper explorations you are looking for. You may want to consider whether it’s possible/accessible for you to pay out of pocket, which could expand the pool of possible therapists.",
  "therapist here- tell them this stuff during an initial intake or a consultation, and see if you’re a solid match with them. also, psychodynamic/psychoanalytic approach therapists. they’re in for the long-haul and digging into deep, childhood, unconscious stuff. shy away from therapists that specialize in brief solution focused, for obvious reasons.",
  "Using insurance might make this more difficult as insurance companies are the ones who want that quick, solution-focused approach. You might be better able to receive this kind of therapy as a self-pay client. However, there are therapists who are seasoned in justifying medical necessity for the type of therapy you are seeking. If I were in your shoes, I'd probably look for therapists who pull from psychodynamic, EMDR, and attachment-focused approaches.",
  "Honestly, insurance and EAPs are pushing therapists to “graduate” clients in a very short period of time. If you don’t want to feel rushed, I would highly recommend going out of network if that’s an option. Also discussing this with your therapist is important too. But especially with EAP clinicians they are being rewarded for value based care and many insurance companies are starting to adopt that as well…",
  "Before anything else, I just want to say a good therapist should be able to pick up on that “all better” mask you put on, even if you don’t say it outright. From the way you’re describing things, you sound pretty self-aware.",
  "You might look for a relational psychoanalytic psychotherapist. If I’m working with someone & they are “all better” or improve at an unusually fast rate, my mind would likely wonder if a defense has emerged (people pleasing, trying to be a good client, not wanting to be a burden or have too many needs)… I might suggest they keep coming & talking to me about the how good things are going. Of course, it’s ultimately up to the client.",
  "I will echo others - psychodynamic. ",
  "The point of therapy is change so you should be working toward something. ",
  "I'd look for Internal Family Systems, Somatic work, Emotion Focused, etc. A lot of these approaches are more long term focused. Also make sure to tell the therapist what your experience has been and tell them what you need. Ask your husband if he knows them, you might want to look on Psychology Today for therapists in your state but not your local  area to see online maybe?",
  "Probably looking towards some experiential or psychodynamic therapies may help. ",
  "Couple reasons!",
  "I am in the social work field and can speak to knowing a lot of local therapists. I drive about 30 minutes from home to see one that I do not know professionally, and while we may know therapists the other knows, I trust her professional discretion not to spill my secrets. ",
  "Why do you want to go to therapy if it isn't to fix something?",
  "I Have Downtime at Work What’s the Smartest Way to Use It?",
  "What’s the most time-consuming task you’ve offloaded that made a big difference?",
  "I just need a little motivation to get through the next few hours.",
  "How these tools help me speed things up",
  "Help me out with brainrot , I can't function properly",
  "Anyone else do multi-site searches daily? I made a spreadsheet to save 50+ clicks",
  "What’s ONE small productivity habit that completely changed your workflow?",
  "Does anyone else feel like productivity apps aren't enough?",
  "Is there a desktop app for productivity",
  "App suggestions for a unique year",
  "Basic habit tracker for IOS (like for Loop on Android)",
  "Is there any calendar app like google calendar (all of its features) that can combine calendars into 1 calendar?",
  "Trying to fix the news overload would love your thoughts",
  "Anyone else more productive sitting than standing?",
  "How do I improve my speech and communication style?",
  "Feeling overwhelmed – Need help planning my day & breaking bad habits",
  "Anyone here used to journal or meditate but stopped? Why?",
  "Montly time calculation app Google Calendar based",
  "My Reading List is 1000+ unread articles and causing me stress and guilt — how do you manage yours?",
  "What’s the one “productivity hack” everyone talks about that never actually worked for you?",
  "Ecosystem Suggestion - Apple vs Google vs Microsoft",
  "Thinking of making a simple text summarizer using ai",
  "What's something that used to stress you out constantly but doesn't anymore?",
  "How to adjust energy limits in MATERIALS STUDIO to avoid errors during amorphous cell calculations?",
  "Things to once I block all social media",
  "1-3-5 method issues - Can't find enough tasks!",
  "How to overcome phone addiction",
  "What's your 'productivity hack' that's actually just procrastination?",
  "I used my downtime to brush up on Excel formulas and shortcuts, and now I’m the “Excel guy” at my office (which has actually opened doors for me). Little skills can really add up!",
  "Take a course online that allows you to go at your own pace, no deadlines so you can learn when you have time and pick something that you think you could benefit from, something that you suck at. I'm taking a free bookkeeping class in June that my library offers because I want to be more financially literate. So, find something relevant to your life right now that you think would benefit you.",
  "Learn to code in that time. Don't need to go the way of video lessons, but rather there are some great platforms out there for learning to code in active ways. You solve puzzles, solve problems.  In my own little world, I learned to code by learning Excel VBA over 10+ years ago and then I learned Google Apps Script. Now I do google sheets full time. and did that for 5 years inside of a company.  Just learn how to automate some sheets, and then go talk to people in your office and business and make automations for them.  It can learned in a few minutes to get started. And then every day is a new little puzzle to solve.",
  "Use that time as professional development time to keep studying in your field!",
  "Besides learning new skills, you could meet people and connect. For example, getting to know people in different departments or those in leadership positions, or connecting with people elsewhere that might lead to mutual learning or professional connections.",
  "Learn to use AI tools well. That can either make your other 7 hours easier or you can churn out more work and potentially advance in the company sooner. If you don’t like your job, use AI to build a new business idea.",
  "If it was me personally, I would take up trying to learn a new language! That's something that can easily be done on a laptop. You could also look into a course for something you've wanted to learn more about (real estate, budgeting, finance, etc.), or for something that is related to your career. Some course websites I've heard are good are Coursera, Investopedia, Khan Academy.",
  "Reading a great book, I do this all the time",
  "Podcasts. Start with first season of Ear Hustle, move onto all kinds of other good ones from there.",
  "I’m not sure if this will work for your context, but I enjoy taking a walk when I have downtime. I pod in earbuds and enjoy an audiobook for 20-30 minutes. Getting outside is a great reset, and you could do this and some other things commenters suggested here.",
  "Poscasts an easy way to learn new things without showing up on your screen so it doesn't look like you're slacking off.",
  "If your passion isn't tied to your current job (love marketing but work in customer service) find a way to apply your passion to your current situation or to the company as a whole based on your current job. You'll get recognized....",
  "i’d personally use that time to see how i could make more money. over the course of a month, that’s 20 extra hours you could use to learn how to start a side gig or a new venture where you can make double income. my friends wife is an accountant and became a realtor in her free time. talk about an extra pay check a month",
  "Udemy has a lot of courses on a lot of topics!",
  "I just learned Microsoft Power BI. Trying to learn SQL now. Also echoing keeping up on new excel tricks. Or maybe you’re less into data, want to play on Canva or create marketing materials?",
  "Some ideas:",
  "Naps, study, or side hustle.",
  "Housework. I have someone who cleans and cooks for our family from Mon-Fri. Hubs and I both work. We have 3 children. So outsourcing housework was a life saver. The stress level dropped significantly. Life enjoyment went through the roof.",
  "Going to the grocery store. Now, I have things delivered. In fact, I have everything delivered. Professionally I’d say that it was helpful to delegate member replies to my assistant.",
  "One of the biggest game-changers was offloading calendar and meeting management. Having someone handle scheduling, rescheduling, and protecting focus blocks freed up a surprising amount of mental energy. It reduced context switching and helped maintain momentum throughout the day. A close second was delegating inbox filtering—just not having to scan through dozens of low-priority messages each morning was a huge relief. Both felt small at first but added up fast. Wish I’d done it earlier.",
  "outsourcing content edits + post scheduling. used to burn hours fixing captions and planning calendar. now AI + notion + buffer does 80% of it. should’ve done it way sooner gave me back focus time for strategy and creative",
  "bathing.",
  "What are you using to create these automations?",
  "I wish boredom could be outsourced",
  "Writing. My blog, LinkedIn posts, Instagram carousels, my business diary. It took me so much time to start doing that on a daily basis. But it helped me in so many ways. To articulate my thoughts, to figure out in what I'm good at, and at what I suck. The more I'm doing it, I see more benefits",
  "My free time :D",
  "Sending Email's Manually and scheduling meetings Automating this helped me save 5 hours a week .",
  "RemindMe! 48 hrs.",
  "Organizing the days, set follow up on emails, schedule tasks. I outsource this to an AI and it works so far",
  "You’ve got this!! Make a list, prioritize, and check each task off as you finish it! That’ll give you a lil dopamine boost for each task. Keep going my friend 💗",
  "You’ll feel so bada$$ once you check these things off the list!!",
  "You got this man! Seconded with the check list part. The satisfaction of ticking those boxes is half the reason I do finish my tasks.",
  "you got it!!",
  "All a process brother, it’s good that you’ve acknowledged that you need to lock in. Keep at it and you’ll be ahead of 90% of people. 🚀",
  "Smart to ask for help. You can do all of it. Making a list each day helps me. Typically I don’t get it all done in one day but crossing off the things you do while patting yourself on the back is great. Keep doing that too. Tell yourself how awesome you are for completing one of the tasks on your list. Do one thing at a time. Just one thing. I fail quite often when life gets complicated. We are only human. Best of luck to you!",
  "Hey focus on finding ''motivation'' from your inner self that's the most powerful way, you don't need external motivation you got this man!",
  "YOU. GOT. THIS.",
  "Just the fact that you came here, wrote this, and asked for support… that’s already you showing up for yourself. That’s self-awareness. That’s care. Sometimes we overlook how much courage it takes to simply say “I need help right now.” Give yourself a moment to appreciate that. I also would like to applaud you for moving your body and trekking. You are doing way more than you think you’re doing. If you like listening to topics about self improvement and mindset shifts, I talk about moments of overwhelm, self-doubt, and how to move through life on my Youtube channel. If you ever feel like diving deeper, check it out. You can find the link in my profile.\nAnd… take it easy! You’ve got this 😊",
  "One thing at a time. Don’t think about what you could have done or wasting prior time.  If possible, find someplace away from your distractions to work.",
  "You got this OP. Sometimes life piles up and it feels impossible to catch up, but the fact you’re here, ready to take action, means you’re stronger than the chaos. Break things down into small steps, celebrate every call made, every task checked off.",
  "You got this! Checking off each item when it’s done is motivation to keep going!!",
  "Anyone else switch to accounting in their 30s? Tell me I'm not crazy lol",
  "BREAKING: My new hourly rate is now $0. Suggested Tip: $1,200 per hour.",
  "This Sub is Funny",
  "Dude why",
  "Turbo Tax Survey “Why didn’t you use us?”",
  "Took a payout for remote work",
  "Advice on quiet quitting while behaving professionally despite knowing both company and boss fucked me with no regrets?",
  "Remember Enron and WorldCom? Let’s Not Do That Again.",
  "Deloitte Compensation Thread FY25",
  "Thoughts on job market?",
  "Passed over for promotion.. What’s the next move?",
  "Ever spend 30 minutes crafting the perfect email response… only to realize you were just CC’d?",
  "2025 Salary Megathread",
  "Nerd alert! Let's post interesting formulas used in Excel.",
  "Industry folks - do you have daily meetings with your team/manager?",
  "I ran out of jobs to apply to and my network is tapped, what now? ☹️",
  "How do you guys style your hair? Whats the accountant hairstyle?",
  "Feeling Stuck After Graduation",
  "Thank you accounting",
  "Flame my resume. I’m a junior accounting major.",
  "Did accounting get you out of poverty?",
  "Accounting or Cybersecurity?",
  "Graduation survey for EY audit is asking if I’ve received any C or C- in coursework for my major since accepting offer. I’m an econ major w/ accounting minor and got a C in tax. Thoughts?",
  "Trying To Get Somewhere",
  "What do they ask in staff accountant interviews nowadays?",
  "Can't land an internship?",
  "Why I am not getting any interviews...",
  "How to deal with imposter syndrome?",
  "I had low income(retail + fast food)and labor jobs until finally graduating at 30. I'm 35 and have a way better life now. ",
  "Started back in college at 37, passed the CPA exam at 41.",
  "I got my CPA two years ago at the age of 35. I had to take a few step backs in my career but back on the upward trajectory. I already had a bachelors degree so went to community college to become cpa eligible. Which saved me a fortune. I’d say go for it.",
  "no it ain’t unhinged my boy go for it. it’s never too late to pivot. i did retail work throughout my teens and uni, and i much prefer my work with accounting",
  "Majored in math! Became a lic CPA late 30’s",
  "I've met many 30+ yearolds, some with families & some 40+, in my community college classes, and then at university.",
  "I worked for a corporation for 20 years. Got laid off a second time and my wife convinced me to go back to school to study accounting. Now have a career I love. Did this in my 40s. You are not crazy! (For this at least) :)",
  "37 here. Restaurant general manager. After a couple of years of adding the bookkeeping aspect of the job to my repertoire, attempting to analyze financial statements with no formal schooling in the matter I decided to go to school to take a bookkeeping cert. I quickly realized a bookkeeping cert will not get me far at all in terms of a lucrative career change. I quickly changed programs to an accounting major degree program. Unfortunately, I will have to do this part time while working. But am very excited to carry on with the studies and hopefully get some work at a firm somewhere in the middle of my degree. 🤞. My only post secondary was culinary school so I am starting from scratch. ",
  "I am switching to accounting also. I start my program in a week.",
  "Yep went back at 33 with the WGU route (2nd degree). Tax internship and now about 2 years into government auditing. ",
  "You are not too old but take cheaper courses at community colleges if possible. No one on accounting really cares where you got your degree especially if you’re going for a cpa",
  "I’m 32 and hoping to go back to school for accounting in the fall to become a CPA!",
  "Yes I graduated with my degree at 33",
  "I was in an accounting adjacent job, so going back to school for accounting wasn't all that far fetched.",
  "Did it in my 40s. Now 47. About to be a Caanz. Reckon I passed my financial reporting exam yesterday. Whenever I’m feeling the juju I tell my partner it’s a law degree next. They are not impressed. I’m pretty sure I’m joking about the law degree.",
  "I went back to school in my 30s to do an undergrad in accounting. Loved it though I found my real interests were in research so I’m working on a Masters and getting ready to apply for a PhD.",
  "Im 47 and my wife 42...we both are working on the pre-requisites. Go ahead and do it my friend, and enjoy the journey!!!",
  "Im 30 and entering my last year for my bachelor. You got this OP!",
  "I switched to accounting in my 40s. I was in the printing industry. Aside from being a rapidly dying industry, it also sucked ass.",
  "I’ve been taking classes slowly since 2020 when I was 31 and finally have 21 Accounting credits and been applying to Accounting positions. Got my first interview at 36 😅",
  "I knew it if I were you in your position. What I would do, though as I would just go to Western Governors University for all your credits online. Make sure you have enough to take the CPA exams, then pass the CPA exams and get yourself network into a smaller firm and then from their network into a bigger firm at the staff two level before you reach senioror networking the big four after you’ve got your staff one your experience at a smaller firm. But now that they’re doing away with 150 your path is a lot easier.",
  "I did. It was a great choice. I'd probably rather be a doctor or an engineer, but accounting is pretty great.",
  "I did. At 35. 100% worth it.",
  "Changed at 38, got my CPA at 42",
  "I finished my undergrad degree in my late 30s, got an industry accounting job and went back for my graduate degree in my 40s.  Working now on getting the CPA.  I'm in my 50s.",
  "Got my degree at 35, was in a similar situation. Best decision I ever made.",
  "Yeah absolutely!  I made the change when I was 30 and it has worked out rather well.  I moved from Restaurants/hospitality into accounting, that is just as big of a 180 ad retail to accounting.  If I had to do it again I would do it basically the same.  I may have changed some of the details, but it mostly would be the same.",
  "2 weeks before i turned i switched from restaurants to accounting. best decision i ever made. feel free to reach out",
  "Same here, 32 and transferring soon",
  "I’m doing the same now! Had a business minor and have some minor AR tasks at my job. I started taking the handful of courses I need to qualify for the CPA last fall, hopefully I can transition to an actual accounting position in the next year or two.",
  "No, when I was majoring in acct back then saw lots of people in their 30s go back to school to get an acct degree/certificate. You’ll be fine. Only thing is acct might not be as stable as it was back then, but that’s the entire economy right now.",
  "Switched at 32! Age has honestly only been a net benefit.",
  "I'm doing it now. Early 30s. And a handful of people in my program are like me, teachers who are leaving teaching and switching into accounting.",
  "I went back to school at 32 for accounting and got hired into government accounting after graduating right before my 36th birthday",
  "Started school last year, I’m 35",
  "My kids are your age.  It's never too late.  Start with accounting 1 and 2 if it's still offered.   Make sure you like it before you fully invest.   Anyone disagree with me?",
  "I went back to school for accounting and got my CPA at 30 right before I started at b4. The fresh out of college staff would make occasional awkward comments about it. Overall it was a good move for me. Fast forward 12 years and one issue with my age that I now face is that my firm has a 20 year vesting schedule for partners and I don’t think they’re gonna make me a partner in the next 3 years.",
  "Along with other commenters, I also switched to accounting in my 30s. I was 35 when I finished my bachelor's, then masters in accounting, and then sat for the exam. It felt weird at first, but then you will see plenty of other people in their 30s or older in various programs, including accounting. ",
  "Being older in accounting is not a big deal\nBc it’s a common career changing field but the cost of getting the CPA is high and it doesn’t always pay as high as you might feel it’s worth. In your 30s the main issue is you might have more life and family commitments and if you choose public accounting, the hours are demanding. You also need to be more strategic with your resume to be taken seriously by employers. However, It will be a more comfortable life than retail with tons more growth opportunity. ",
  "I'm a forester for a local government and am switching over to accounting at 32 y/o.",
  "Took my first college class at 42. Now 49 and CPA back in February. Work in public. Figure I’ve got plenty of time to get a return on my investment. Would definitely do it again knowing what I know now. I say go for it",
  "I’m 29, almost 30, and I’m taking a break from accounting classes due to personal circumstances. I really appreciate these comments, definitely feels like something I can come back to when the time is right.",
  "Start with a community college associates degree in accounting and by the time you have that you can probably get an entry level position at like a non profit (I hired plenty of associate accountants during my tenure in non profit) and then continue your education for a bachelors while building your resume at the same time",
  "I'm 41, in last class for bachelors. Go for it.",
  "I’m 40 and will graduate in December with my bachelors in accounting. Getting ready to start a summer internship where I’m sure I’ll be old enough to be mom of the rest of the interns. I have zero regrets so far. The coursework is challenging but isn’t impossible.",
  "I just turned 31 and still have like three years left. I’m working in manufacturing and my body kills be everyday so I needed a change. Glad I’m doing it!",
  "I was criminal justice oriented all my life until I got to 27. I had never touched any subject business or finance related. Had a wake up call when I realized I’d soon be out of my 20s and still didn’t have a real job. I took a random accounting class and now I’m well on my way to a bachelors in accounting. Make the change. It’s NEVER too late.",
  "Hi, if you’re thinking of doing accounting, I highly recommend WGU. It was super affordable for me and you can accelerate if you would like to get it done faster. I was able to get it done within a year and now I have a job at a CPA firm.",
  "DMing you",
  "Do it, it's never too late.",
  "You'd be crazy to not switch. It's a really really good career for the hours you put in and the money you get back",
  "Good luck!",
  "I worked retail until I was 34, then decided to go back to school for accounting. It took about 3 years, and $22,000 total. My very first job after I got my degree was a salaried position with better hours, better vacation time, and that paid $20k more than my previous job, and I got a raise after one year, so I definitely think it was a good return on investment. ",
  "I worked retail, construction, and hospital administration before going back to school 2 years ago for accounting. Just finished my masters and am currently studying for the CPA at age 45. No regrets here.",
  "We have a Sr Manager in our office who got herCPA when she was in her mid-40’s.",
  "I did that, started school at 34, completed masters in 2023, became a CPA in 2024, while in school completely internships and worked in hospitality in between, got promoted to senior within a year starting full-time at the same firm I had internship ( PA)",
  "Me! Started an MSA night program at 30, went Big 8. Excellent move.",
  "I was a 30 year old intern. Totally worth it.",
  "I did at 28. My friends did at 30 and 32. ",
  "I just turned 32. Graduated in April with my bachelor’s. Had an offer in hand for an August start by January this year. Studying for CPA between now and then. Do it. Go back, put in the years, and make it happen.",
  "Used to work at express full time thru college. Hated it and fully agree with switching. It’s not too late. With AI you can learn anything. It’s a very patient teacher so you can ask all the questions you want. It will be a learning curve and you’ll have to work hard, but you can definitely do it.",
  "When the Accountant 3 movie comes out I want a segment on tax free tips and depreciating land",
  "If people do start reporting their tips more, states with income tax are going to start seeing a bump in income! Their federal tax bill might be low, but their state tax bill will be a big surprise. ",
  "Isn’t it on cash tips only, which I don’t think are reported typically anyway… lol",
  "I feel like this is going to break the system. Why can’t other professions say they work off of tips? Accountants? Construction workers, etc",
  "How did this pass unanimously? If your goal is for lower wage workers to pay less tax that's fine but this is just completely stupid pandering.",
  "Fyi, only the first $25k of tips is deductible.",
  "The service is free but I’m gonna flip this iPad and it will ask you a question…",
  "You’d think an accountant can read the part where it’s limited to certain professions or the other part where it only applies to incomes below $160k.",
  "Why give a tip now when it won't be taxed, while every penny I make is taxed?",
  "Doesn’t this incentivize businesses to pay their employees absolute minimum wage and push the broken tipping culture even more into madness?",
  "You make 25k a year. ",
  "I expect my VC to be a Tip.",
  "Nice, I'll reduce my tips paid by ~35%.  ",
  "Pretty sure the law states that it has to be a job that is traditionally tipped",
  "\"The exemption would apply to tips given to workers “in an occupation which traditionally and customarily received tips on or before December 31, 2023,” according to the legislation. The Treasury secretary would be required to produce a list of occupations that fit that description within 90 days of the bill’s passage.\"",
  "More like more people will claim the tips to get the credit on the withholding, only to find out they have to pay the FICA tax. When they would have not claimed the cash tips at all.",
  "I won’t be tipping anymore.",
  "It's only $25,000 in cash tips that are exempt from federal taxes. Employees must claim the tips so the employer can withhold payroll taxes. Almost no one claims the small amount of cash tips they currently get. This is literally just a way to get them to claim those cash tips and still get SOME tax from it, just not as much as it normally would be with federal taxes.",
  "I'm excited to get accounting services for free.",
  "Going to tip less now since they get to keep more.",
  "I guess I can tip less now since they aren't paying taxes 🤣",
  "I'm about to start tipping 12% less to makeup for it.",
  "More fraud and less IRS agents to catch it, they cooked.",
  "I'm funny how, I mean funny like I'm a clown, I amuse you? I make you laugh, I'm here to fucking amuse you? What do you mean funny, funny how? How am I funny?",
  "Usually reliable way to middle income or high middle income jobs. Work life balance can suck at times (month end, quarter, annual close and audit in industry. Peak seasons in public). Industry it is easy to get overlooked since we aren't revenue generators. There's some apprehension about AI and offshoring and it certainly seems justified in some areas.",
  "The baby boomer retirements through 2030 are supposed to be insane and everyone seems to have forgotten about it. ",
  "When the IRS staff catches up to this and agrees with you, it’ll be 2026-27.",
  "For some perspective:",
  "I’ve just accepted my fate at this point…I’m 20 month from paying off my students loans and I’m in my early 30s so I just don’t have it in me to switch…also ageism is a bitch.",
  "No it legit suck (accounting) and I wouldn’t wish it on my worst enemy.",
  "In what world is busy season only January to April?",
  "Loool so true",
  "The 1st four months is hell but the other 8 months is pretty peaceful",
  "I mean, the things you get to work on and learn about are interesting, and I actually like that about this profession.",
  "People don’t believe me when I say this sub Reddit has no right being as funny as it is.",
  "lol at “amazing job security”"
]