[
  {
    "text": "How a $47,000 payroll mistake almost killed my agency",
    "has_problem": "YES",
    "confidence": 10,
    "category": "professional"
  },
  {
    "text": "I keep seeing the same revenue leak in every company I work with and it's driving me nuts",
    "has_problem": "YES",
    "confidence": 10,
    "category": "business"
  },
  {
    "text": "To the Entrepreneurs with a spouse you build with... how do you balance it?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "personal"
  },
  {
    "text": "How do you market your business locally on a budget?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Five failed businesses and mentally unable to start another. Advice?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "personal"
  },
  {
    "text": "How do I validate my idea?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "How to know when to take the leap to become a full time founder",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Wow. This is horrible service on a very different level. Imagine their clients who are yet to wake up and realise this.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "Thera is the best payroll service. My team started growing globally and I got burned by Gusto, so it made sense to make the switch. Less expensive either",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "That's brutal. Payroll is the ONE thing you pay these services to handle because screwing it up wrecks your business (and sanity). Insane how they didn't even have the decency to warn you when things broke. Good move cutting ties, after something like this I'd never trust another SaaS blindly again. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Talk to the IRS. They waived the penalty for the tax mistake my accountant (read: husband) made because it was our first incident and we resolved it.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "for what it's worth.  I agree with you.  Gusto is garbage.  They're one of the worst of 'promise the world' but never deliver.  Avoid 'em. Curious how thera goes for you",
    "has_problem": "YES",
    "confidence": 8,
    "category": "customer_service"
  },
  {
    "text": "Damn that’s messed up, we use Gusto with 2 companies and the 2nd one had issues getting the tax stuff setup right with the state. Please keep us posted",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Definitely sue them for breach of contract. You paid a fixed amount for their services, with a promise of specific and measurable tasks, and you have a quantifiable number for your real damages. This is the kind of thing you ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "Similar thing happened to me with Quickbooks Payroll.  Had to contact them multiple times to hear how they’ll resolve it asap and never figure out the problem.  When I got the IRS lien notice my language got stronger and they figured it out!  They claimed the IRS reassessed my payroll tax and didn’t tell anyone which I’m not sure I even believe.  They are covering my penalties as a credit since they did accept responsibility as the ones running my payroll. Still sucks to have a surprise $5k payment when you think you’re doing everything above board by hiring a professional payroll service",
    "has_problem": "YES",
    "confidence": 10,
    "category": "financial"
  },
  {
    "text": "I’m going to commit unspeakable acts if I have to see that stupid Gusto loading “friendly pig” one more time.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Having been with ADP before Gusto and having used Gusto for years across 3 businesses , I can tell you that ADP is far worse and makes far more errors. That said, Gusto isn’t perfect by any means and getting an answer from them takes far longer than it should",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Just want to share that rippling and other payroll software showed similar issues and a very poor attitude to fix.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "this is stuff within spectrum of running a small business. Just sue them, and make them pay your legal bills, lost business income, personal time wasted, and government fees. Let the lawyer handle it.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "I would get a payroll service that guarantees their service. Quickbooks full service guarantees their work. So when they do mess up on late payments or a return they pay the penalties and interest.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "You have immediate grounds for legal issue. Run do not walk to your nearest attorney.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "Ask me about my bench.co and TaxRise nightmare.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "No comment. Just edited an EU call for AI automation of government processes grant proposals flagging precisely this shortcoming in their reasoning. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "This is why it pays just to suck it up and have a payroll position where that person is your salaried employee. It will cost you more but well worth it.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "Was this for Q1 of this year? My company uses Gusto and I just got three late filling penalty letters from three different states. After looking into it, Gusto filed them all two weeks late even though they had the info and had been filing every cycle without an issue for the last two years.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "They always fuck up proper taxes.  But then never handle it, fix it, and business is stuck with penalty.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Holy shit, OP. As someone who once accidentally paid an intern $90k(thanks, QuickBooks 'Learn as You Go' mode), I felt this in my soul.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "I’m lawyering up all day on this one!",
    "has_problem": "YES",
    "confidence": 7,
    "category": "legal"
  },
  {
    "text": "You are paying $600 per employee per month for payroll automation? 600x23 = $13,800 per month?... and there is no guarantee of accuracy or service-level agreements?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "FYI adp is no better",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "You're absolutely spot on. I'm running a small plumbing company, and even at my scale, I've noticed this exact issue. Big plumbing firms around me spend thousands chasing new leads but drop the ball on simply following up quickly and clearly with the people already reaching out.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "I used to do online marketing for small businesses. Had a roster of like 200-300 clients. Most of my conversations with business owners was them screeching at me about how all of the reported leads were made up by my company. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Yeah basic shit. I go into a lot of companies as fractional CTO and I find most of them don't have basic document tracking.  They throw everything in Google docs and have no way to know what's what.  So I usually institute coda (similar to notion) and teach them how to use it with maybe a tutorial, a video or two, and lots of teaching by example since I use it religiously.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "do you have a Bible for this stuff? like a set of benchmarks you can just go through Salesforce with? ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Unlike consultants, internal employees are a) not paid extra for figuring these issues or b) their ideas get rejected by managers and hence, they are not motivated to find such problems. As a result, these issues are common across companies. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "yep, this is spot on. i’ve worked with business coaches across a bunch of industries, and this exact thing comes up constantly. everyone’s chasing “more leads” when the real win is usually in what happens after the first touch.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "\"Average response time to new leads: 23 hours (should be under 5 mins)They follow up twice then give up (most people need 7+ touchpoints)Proposals sit in email for weeks with no follow-up",
    "has_problem": "YES",
    "confidence": 10,
    "category": "business"
  },
  {
    "text": "Totally happening almost everywhere. Spend a ton on leads and only the rare few desperate clients convert on their terrible sales strategy. See it all the time too. Typically when they’re telling me my leads suck before I listen to the call logs. Need to start vetting every buyer I sell to. You are 100% right on this.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Thank you so much for saying this. Try to purchase solar, gutters, basically any mildly complicated service or product and the consumer is chasing the company for months!",
    "has_problem": "YES",
    "confidence": 10,
    "category": "customer_service"
  },
  {
    "text": "My co-founder and I have built an AI voice agent specialised for outbound which address these pain points you've mentioned about response times and follow-ups ~ hope tools like this get more widely adopted across industries and improve the productivity of their existing teams",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "This is insanely on point  I run a small data consulting firm and can 100% confirm we’ve been guilty of this. Right now we have one high-value client that takes up most of our time, and while I know the service is solid (we’re doing all of their reporting/ops analytics), I’m stuck trying to figure out how to actually ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Im facing this same problem and looking to implement some fixes to up the win rate of current leads. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "I’m trying to figure out Hubspot to help automate this. Everything is hard.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "How do you structure your compensation? Hourly consulting?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "You’re 100% on the money. Answer/return phone calls, show up when you tell someone (who is interested in giving you money) you will, answer emails somewhere between immediately and 24 hrs (even if it means you telling them\nYou saw their email and are looking into it).",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "I worked as a copywriter for a while and saw this in so many places. They usually hire a copywriter because there is some crisis going on. I'd get in there as ask questions and whoops, the return call rate was fucked. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "I’m seeing this in our own business. We have a huge database of leads (direct to consumer but high ticket sales). Not sure how best to start testing ways to reengage/get back in touch.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Could you add a customer request to time the response time via email/phone/text to get data before approaching the business? And evaluate the response quality? Then you have good data point to sell the optimization service. For example, I contacted a car dealer about a specific car listing. They add me to email blast and do not answer the question about the car (no human read the form submission).",
    "has_problem": "YES",
    "confidence": 10,
    "category": "customer_service"
  },
  {
    "text": "I agree. Too often we are so focused on \"New\" business we neglect our legacy business. No matter what your business your legacy customers always have new business needs and even if you can't provide for their new needs you might know who can which then makes you more valuable to them.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "I’ve seen this a few times, people are usually sitting in a gold mine of leads that they never reconnect with.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "I've seen it for decades.  The problem has remained stubbornly entrenched through the years and massive changes in technology.  I feel like it's an interesting combination of two human nature problems.  One is at the front end, where it's just sooo much easier to wait for something to happen than make something happen even if you are waiting on a dime during the period of time where you could be making a dollar.  The other is on the back end where correlation is perceived to imply causality.  \"For every ten leads, we make $10, we want to make $100 so therefore, we need 100 leads.\"",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Man I am seeing this with every local company around me right now. Call, they come out to assess (lucky to get a quote without an in person visit for anything), get a quote and a date for them to come out, they never show or follow up. I call, text, message, no answer just ghosted. They keep running ads, posting on FB groups and everything. Like how are these people making money?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "I recently needed to replace my roof. I called 3 local roofing companies. One of them got back immediately, came to my house and gave me an estimate. I was very impressed, however then the sales pressure tactics started. Which I didn't appreciate. I would have used them otherwise. \n ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "over the last 25 years, my company growth was by word of mouth",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "I’ve consulted/trained in automotive for 10 years. Every single one would rather spend on advertising rather than get better at closing what they do get and treating customers like humans. Not even well, just normal.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "That and lost deal recovery which is something I am focusing on now.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "This could be applied even to private practice: psychotherapists. The response time to each client can end up being too long for the client and so they go elsewhere, like to an inferior BetterHelp-type company. But if therapists ensured they had good admin skills, then they could really benefit. I know this isn’t the exact demo. But it makes so much sense what you’re saying!",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "I think, standing back, what I see is that companies have a bunch of data and don't know how to use it to evaluate systems and processes.  I'm an HR consultant and people don't know that their actual culture, not their intended or marketed culture, is in the data.  So are ways to change it.  They don't know that you can measure unhappiness or toxic pockets by looking at data on theft, padded expense reports, time card fraud, ER issues that are more about personality than something that's an actual code of conduct violation.  And NO ONE uses recruiting data properly.  If I were to do a three year look back at hires, I would want to see who the recruiters and hiring managers were, what the interview process was, where they were sourced, what companies they came from, and any other commonalities of current employees.  I'd look at the same info for people who had since left the company, vol or invol.  I heart data so hard.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Totally. I’ve seen the same thing... teams chasing more traffic while ignoring the leads already knocking at the door.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "I Have been trying to get a job for 3 years. I have two master's degrees AND SPEAK AND WRITE FLUENTLY IN 6 languages, and I am a US CITIZEN. I have tried networking in person and online, attending job fairs, making recommendations, and getting more certifications. Nothing worked. The moral of the story: jobless since May 2022, over 2000 applications filled out, over $25000 spent in networking events, classes, lunches and dinners, travels, conferences, seminars, workshops, online certifications, grants applications, general meetings, interviews, Tests, accreditations, interrogations, inquisitions, background checks, finger-printings, medical exams, drug tests, check-ups, mental check-ups, psychological check-ups, psychiatric check-ups, autoimmune check-ups, all kind of psychological tests, job-specific examinations, oversees travels, abroad meetings and STILL CANNOT GET A JOB or even an internship, or a remote or a hybrid or part-time or per project work, I cannot get even fundings, loans, grants, lines of credit to open my own business. I am left with $250.000 of student loans, among other debts. This is the Real American Dream",
    "has_problem": "YES",
    "confidence": 10,
    "category": "professional"
  },
  {
    "text": "If AI Eats the Clicks, How Do You Get Users for Your SaaS?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Solo founders & tiny teams - what’s the one thing you still can’t hand off to AI?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "productivity"
  },
  {
    "text": "I’m getting tired. It’s hard to find what works at scale",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "Want to boost your local SEO?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "Need help with backend automation offers",
    "has_problem": "YES",
    "confidence": 9,
    "category": "technical"
  },
  {
    "text": "I have 32k Twitter followers. Dozens signed up. 0 paid. Audience ≠ customers.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "50 new subscriptions, 1.8k total signups => \"Loved by 8336 creators\" on you website :) Tell us the truth pls",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "it's all about $$$$$. you would be shocked at the amount of money people are throwing at everything. no chance against the algorithm even if you have found AGI.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "I'm also facing a similar question. Just today I posted a question on the subject, because I only received 3 votes but I did customer discovery research and built up a significant infrastructure, and now I don't know if the failed launch shows that there is no need for it in the market, or if it's not really proof.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "PH is not what it used to be, it's true. The way I see it today, the platform can help put you on the map, offer early social proof and feedback. You may attract some traffic and a few early adopters, but it's crucial for the product to be of interest for the PH audience. Not all SaaS are even considering launching on PH, and that's for a reason.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "Agreed and the worst think is that it freaking cost too much",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Well I have been reading similar posts lately and I have been debating if I should use my connections an build a premium version of producthunt where you get to meet investors and get voted by a community of professionals. You can also get matched with advisors. Sort of like shark tank but get help building and get real results.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Product Hunt is not organic. It's gamed. People pay for good launches and they pay for votes. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "How are you dealing with / going to deal with the new  10DLC compliance requirements?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "legal"
  },
  {
    "text": "How do you talk about your app on Twitter everyday?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "how did you collaborate with journalists? do you already have contacts? how does that work",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "I have heard SaaS founders complain about the difficulty of dealing with paying taxes when doing business in the EU, because of so many different systems.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "There is a way to call with my personal number as a caller id with your app? Also: do you have planned to insert a monthly fee for unlimited calls?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "technical"
  },
  {
    "text": "Yes, I think apps should be developed based on specific needs rather than for a particular technology.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "technical"
  },
  {
    "text": "How much actual market research did you do before you started? I studied business studies and have a bachelor in entrepreneurship, and got absolutely bombarded with the importance of extensive market research, competitors, models and analyses, value proposition, environment analyses, etc. I feel like most people that are successful nowadays with SaaS- and other kinds of businesses don't do much about strong, extensive market research.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "how did you get funding for doing all these",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "These types of SaaS perplex me. I can get a blog post with just a lazy prompt on any LLM. Why would someone pay extra for it? Is there an extra killer feature that I'm missing?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "I tried your site and learned very quickly I need to fix how my site appears on the web.  Your llm got everything about my site details incorrect.   Looks like I need to fix that first.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "technical"
  },
  {
    "text": "Why do you think that cold outreaching to users on LinkedIn went wrong?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "Confronting my boyfriend after I caught him getting physical with my sister?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "personal"
  },
  {
    "text": "Has any other ex-Christian felt deep grief after losing their faith?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "personal"
  },
  {
    "text": "People who misuse the public toilet why do you do it?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "customer_service"
  },
  {
    "text": "Should I call off work because I have no gas to get there?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Why do true crime shows have the worst victim picture?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "media"
  },
  {
    "text": "In Norway, I believe it’s a Harry, and going to Sweden or Finland to buy cheaper alcohol and stuff is a Harrytur!",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "As far as my understanding goes, there's supposed to be one in BC, along the highway of Tears. Over 50 missing Native women and girls. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "Billed $1,300 for a \"free screening\" from my urologist",
    "has_problem": "YES",
    "confidence": 10,
    "category": "financial"
  },
  {
    "text": "should i just wipe my credit card debt with savings?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Feeling frustrated because parents want me to put their new car under my name and co-sign the loan",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Should I sell my car to pay off $19k credit card debt and save for a cheaper one?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Used to work at Target, still have 8k in the 401k. What should I do with it.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "Any tips for helping my retired parent start investing?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "What can I use my FSA for?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Should I temporarily reduce my 401(k) contribution to pay of CC debt?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "What to do with savings",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "Making ends meet while waiting to receive sign-on bonus",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Should I cash out my universal life insurance policy or keep it?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "how does a credit card work ??",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Too many 401ks, should I roll it all to current company?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "22 and in $23K of Debt After Flight School and Failed Sales Job – How Do I Actually Rebuild?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Unemployed, should I pay off my debt?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "2 IRAs + 401k + New 401k what to do if anything?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Moving across the country, when to buy new car?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "personal"
  },
  {
    "text": "New Job worth move to higher cost housing?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "What do I do with my money",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "Need to get a new roof. Should I get a loan or wait it out?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Is there a “realtor advisor” like there is a financial advisor?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "What state are you in? This sounds like a bait and switch scam. If the office that sent the “free screening” offer can’t demonstrate they really were doing free screenings, they might be violating rules in your state. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "Tell them \"I came in for the free screening, that is what was on my confirmation email. Here is said email. If you performed something that ",
    "has_problem": "YES",
    "confidence": 8,
    "category": "customer_service"
  },
  {
    "text": "Common bait and switch they do. I don’t have any advice but I’ve heard of this happening before. It’s free up until you trail off and change the conversation topic with the doctor, you start talking about other things and all of a sudden it isn’t free. It’s a trap",
    "has_problem": "YES",
    "confidence": 8,
    "category": "customer_service"
  },
  {
    "text": "OP even if the screening morphed into a regular visit 1300 dollars seems extremely high and something your insurance should’ve written down (deductible or not). You may end owing something but that seems extremely excessive.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "This is something that all doctors are doing now.  I went in for my yearly checkup and we discussed issues as I'm aging.  Bam, I got charged for a visit due to getting a new treatment recommended.  What's the point of the yearly exam if talking to your doctor about anything going on will charge you anyway as a different type of visit?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "one star reviews on all review platforms and name the doctor.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "customer_service"
  },
  {
    "text": "This happens all the time with us, we go for our free annual checkup and find a bill for $400-500 each after a week. my wife then has to call the doctor's office and argue with them until they recode everything so that it counts as an annual free checkup.",
    "has_problem": "YES",
    "confidence": 10,
    "category": "health"
  },
  {
    "text": "You may be able to get the price reduced by getting a retroactive referral from your primary care provider",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "Complaints to the state ag office, medical ethics board, and your insurance company. At best this was \"bait and switch\" at worst outright fraud.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "File a chargeback for the $140 you paid too.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "I would start by reaching out to your PCP to see if they will put in a referral for urology retroactively. I believe a referral can be placed retroactively up to 30 days(?) after the specialist visit, at least in my state.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "health"
  },
  {
    "text": "Do you have ACA insurance? In my experience, doctors will almost always try to convert those \"free screening\" visits into an office call by getting you to talk about things that fall outside the umbrella of a \"free screening.\"",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "Reach out to the patient advocate for the hospital/clinic system, explain the situation. They often escalate it to managers. Unless it’s private practice the doctor does not have much control here. They will light a fire under the clinic until your problem has a definitive answer. If you booked under free screening and that was what you were under the impression was happening, they should not be charging you for the visit.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "That’s beyond frustrating, and honestly it sounds like a bait-and-switch. First step is to dig up that original email confirmation with the words “FREE SCREENING” and save it like gold. That’s your proof. Then file a formal dispute with the clinic’s billing department in writing, referencing that email and every detail of the scheduling switch. If they won’t budge, escalate it to your state’s medical board and insurance regulator.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "Part of this definitely sounds like shady business practice.  Part can be chalked up to \"things people might not understand about insurance\" until they are looking into it.  A few things that caught my attention:",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Same exact thing happened to me with a colonoscopy. Since I have a very strong family history of colon cancer, when I turned 19 I was supposed to start getting a colonoscopy yearly, (because my dad died of colon cancer at 29yo) but just got my first one in 2023 when I was 23. Every appointment was “this will be a screening based on family history”, yet when the colonoscopy was scheduled and I’m all checked in, they go “and that will cost 1150 how will you be paying today?” LIKE HELLO??? They said because I mentioned anal bleeding ONCE due to an internal HEMORRHOID that my colonoscopy was now not a screening, and insurance wouldn’t cover it. LIKE WTF?? HOW IS THIS LEGAL??",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "Tell them to kick rocks and that if they continue to harass you you'll be contacting a lawyer for false advertising and predatory practices. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "I’m wondering since you have a family history they coded it as a diagnostic test instead of just a general screening. Were you having any symptoms?  That can cause a coding change as well. Definitely call your insurance",
    "has_problem": "YES",
    "confidence": 8,
    "category": "health"
  },
  {
    "text": "Replying specifically to your edit, OP.  Honestly, this shouldn't rely on how they coded it.  Or rather, you shouldn't be on the hook automatically because they coded it wrong.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "technical"
  },
  {
    "text": "If you’ve tried to work it out with them and they refused, report credit card fraud and complain to your state’s attorney general. Make those greedy scumbags sweat.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "I would still make it a policy NOT to hand over payment until i have all the required information to make sure amounts are correct.  Sending me a bill when my insurance covers services seems unreasonable.  If they can’t provide reasonable information, like the charges was this for this item, and insurance covered this amount, then they are sending an incomplete bill.  And I would need that information to verify with insurance payments.  If they don’t match, they have incompetent staff or they are a shady practice.  ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "Yup! My primary doctor did the same thing to my regular annual visit. I’m in the process of finding a new doctor.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "health"
  },
  {
    "text": "I've seen this with vaccines, too. They advertise it as free, but require insurance when you get there. Really stretching the definition of free to mean \"Free to ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "Something like this happened to me and I called the hospital. I was adamant that three different people had told me it would be free and that I would NOT HAVE DONE IT if it hadn’t been. They removed the charge. You might be able to get out of it by complaining.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "100% absolutely use your savings to pay off your credit cards. Credit card debt is basically a financial emergency, and a totally worthy reason to deplete your emergency fund. Focus on living within your means (make a budget) and work to re-establish your e-fund moving forward. In the event of a true emergency while you have nothing in savings, you can use your cc and be no worse off than you are now.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "This is the exact reason you have an emergency fund. 20+% debt is an emergency.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "If you think “nothing Wild” is having $8.4k in credit card debt at 18 years old, that is a bigger problem than the symptom.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "That does not apply when you are paying 28% interest!",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Yes, add up what you're paying in interest. Pay at least the 28% off. And then hope for a balance transfer promo and if there's enough credit,  transfer it and work hard to pay it off.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "If you keep at the rate you're going soon you're gonna have more debt than savings, sooner rather than later would be the right time to pay it off.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "How you rack up $8K+ in c/c debt as an 18 yr old?  Thats wild as hell.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "I’m unsure why this is even a question. Pay off your debt. Like yesterday. You’re never going to qualify for anything if your credit score sucks. You can rebuild your savings",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Absolutely.\nWhen my wife (masters in personal finance and Masters in business and accounting) moved in with me, I told her I was so proud of myself for having 12k in savings. When she realised I also had almost the exact same amount in a car loan debt, she gave me a very stern lecture on how idiotic it was to be earning 5% interest on 12k while paying 9% on the same amount at the same time.\nI didn't have the heart to tell her when I found out I was actually earning 0.01% interest because there was a bunch of different criteria required to get their actual advertised rate.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Clear the debt immediately. It is costing you money every month and potentially hurting your credit score.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Credit card debt is an emergency. Your money is on fire. Put it out asap",
    "has_problem": "YES",
    "confidence": 10,
    "category": "financial"
  },
  {
    "text": "Wipe the debt.  You say you are afraid of an emergency, but the credit cards get you out of the emergency.  Fighting 22%+ is near impossible if it gets stacked to high.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "I agree with the others. Be strategic, don’t deplete your savings but try to make debts on that cc pmt",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "yes interest is way high. pay off today",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "Just do the math and look at that high interest rate your paying . The only way it will work is if after your debt free keep making that payment back to your savings",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Maybe in addition to paying down a large chunk of the credit card. Not sure if it’s one account or multiple or if you’re adding more debt while paying down.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "The credit card company has savings deposited by people like you that they use to lend out credit for card holders like... You. They keep a cut. A big one. You're providing it. PAY THE WHOLE THING OFF. Do not build credit card debt. If this happens again consider getting rid of your credit cards.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Yes, but then your lack of emergency fund is itself an emergency and you must treat it as such.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Yes, absolutely. You're throwing money away. You should have been spending your emergency fund rather than credit cards. What do you think it's for?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "You need to pay it off. You will never get the total down with just paying the minimum. If you want to keep some savings, then keep 2K in savings, and use the rest to pay down your debt, which should leave you with 1.4K debt. Then be aggressive with paying that down as well.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "I’ve been around the block a few years more than you (okay a lot more) and would suggest a combined approach that others here have mentioned. It’s possible you could have an emergency of some sort where you can’t use a credit card. Also, card companies can cut you off at any time or reduce your credit limit with very little notice and you have to keep paying even though you can’t use the card anymore. This happened to a lot of people in 2008 and right now the economy is uncertain. And if you’ve depleted your cash, you could end up in a worse situation. So I would keep some in cash if it were me. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "You know you're paying a LOT more money by only making minimum payments, right?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "You do realize if you continue to make the minimum payment, it can take you up to 10 years to pay it off and you will, in the end, end up paying around 15,000 or more total? ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Yes, pay it all off, then try to build 1k savings.  you should pay off your credit card every month.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "What in the hell are you doing, running an 8K balance on your credit cards at 18?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "8.4k is pretty wild at 18 but you could just kill it. I know it’s scary but I did something similar not too long ago, it sucked putting such a big dent in my savings but the projected time to pay off my credit card was a lot. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Yes. You're paying way more interest on that debt than you're earning on that savings account.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Absolutely do not wipe your savings to pay these off. You should always have a couple grand available if you need it.  You can use some of the savings to make a decent chunk, maybe use 4K or something. Try to budget so you have extra cash to throw at it, start with the higher interest rate first. Then after that one is paid off focus on the other card. ",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "Yes, but you need to stop using credit as much while rebuilding that savings.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "unless the interest on whatever savings account you have is 29% it makes the most mathematical sense to pay off the credit card debt instead of holding onto money you don’t really have. like other comments said- your credit cards can act as your emergency fund until youve built that back up",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "I can’t imagine making $15k–$30k at once… how do people do it?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Selling my small business in 4 week... so scared to tell my employees",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Please Don’t Let These AI Crooks Take Your Money",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "I freeze on sales calls. How did you get better?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Is there something like a shark tank but for even smaller businesses that just started and have patents?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "What’s the best way to scale cold outreach without overwhelming the sales team?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Need help improving my backend automation offers",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "What’s everyone using for a basic POS or cash register setup these days?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "Need Advice: Saturation killing my ideas",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "I want to quit my job and focus on my small business. Advice?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "realistic Roleplays for Cold/Discovery Calls for sales",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "Is Sales Navigator a must for lead gen?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "From Brick & Mortar to Ecommerce??",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "Most likely a change in mindset.  Depends on what you're selling.  I'm a contract software developer.  Over the years I have developed software and processes that have saved my clients millions of dollars which makes me think I might not be charging enough.  I've done projects that literally replaced full time positions (don't worry nobody got fired, they just moved the personnel to other positions).",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "If you are in sales (and we are all in sales)iIt takes just as much effort to close a $500 deal as a $15,000 deal.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "Bro it took me a while but part of it is getting out of that hourly mindset. ",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "Honestly.... it ruins business. I hate doing smaller projects now. When IRs were low, mid 5 figure checks were common for me. Now its low 4's.... FeelsBadMan",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "What does your marketing, emailing, website, product pictures, etc. look like? Are you sending the right message to the customers you want to attract? Just because you might not spend that much at one time doesn’t mean there aren’t people out there who will.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Its not that crazy for me to make a sale that large but I only personally keep like 40%. So it takes alot for me to be really excited",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "I make around 11k a month but also so boring so it just sits there. 🤷🏻‍♂️",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "Would say more than half the time they are playing the D measuring ego game and talking revenue, not profit.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "I build energy management systems for Battery’s and microgrids. We can make $150k on a project. I don’t feel like it is that much though. Been in business since 2017 and I still feel like I’m struggling. Matter of fact I’m looking to raise money now",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "Slow and steady growth. There are rare examples of people who manage this kind of thing quickly without burning out. But most people don't have the infrastructure or bandwidth to deliver the sort of customer experience you need to after that to keep momentum going. We have several days like that per month at our shop and days that are significantly higher than that during the Holiday season, but it took several years to get there. But we've grown by almost 100% over the past 12 months and, even after being in it for almost 20 years, our systems and infrastructure weren't ready for that sort of rapid growth.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "$100k just to build a pool, spa and a slide these days.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "My AC guy quoted me $20 k to put in a 2 ton AC unit ~ $2 k. So he trying to make $18 k in an afternoon.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "It's $15K revenue. After paying costs (variable and fixed), the profit is much smaller.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "People don’t “make” 30k on a project. That might be their work for 2 months and profits need to last 4 months.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "Seeing it can shift your mindset massively. I noticed in the digital marketing agency space, almost all the successful owners had been in a previous successful agency as a low level employee in the past. It took me years of hearing about it happening and through trainings to even conceive it possible and baby stepping like a lil bitch before it happened. It didn't need to take that long and I lost a lot of momentum starving for cash flow due to it. Get there as fast as you can before you burn out.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "You prioritize your best customers and phase out the worst. I don't even bother with $15k projects anymore, you can't grow to something big at that price. I now work with enterprise only where they understand nothing costs 15k. 30-100k is the norm now for a 2-4 week project.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "I would not break the news before closing. For example, if 30% quit he has basis for re-negotiating or delaying the deal.  ",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "Dudes trying to crash your business so they can swoop a cheaper price.  Absolutely do NOT do this.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "Please DO NOT tell them until papers are signed and the sale is complete!! A friend of mine was in the process of selling their business, told the employees before closing, they all quit and the buyer backed out. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "I went through this twice as an employee, once with a small business where the owner told us and once with a large business where we found out after the sale. From an employee perspective, the small business sale was more uncomfortable. Because he had told us prior to the sale being finalized, we had no concrete direction or plans - everything was a “guess we’ll wait and see.” It frightened a lot of employees.  ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Seriously?   There should be a whole comms plan agreed with the buyer that occurs right at close.   Typically critical employees offered retention, managers prepped and told first and armed with FAQs for staff, then general announcement.  ",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "I worked for a company that announced their sale. I left shortly after, with a couple others and we all took a pay cut. About a year later, we found out the owner of the company we moved to was in talks of buying out my old company. Owner never sold. Buyer backed out after we all left and worked for him. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Been there .    Sold in 2020 and we told employers … buyer bailed day of sale - we were fortunate our employees stayed.     Sold again last year and didn’t tell them u til 30 days AFTER the sale.  New buyers hired all of our people and a year later all is well.      Hindsight says never tell them pre sale but for us it all worked out.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "Just to clarify; they’ll have to report to the new owner or do they lose their jobs because he plans on bringing his own teams in?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "95 employees is not particularly small and I’m guessing the sale price runs into single or 2 figure millions. Are there any retainers and/or bonuses going to any of the 95 employees that have helped you build that business up?? Either from the buyer end or from your end?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "Absolutely do not tell the employees in advance of the closing.  If for some reason the sale does not close you will lose employees because the minute you tell them about selling the company a good number of them will start looking.  ",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "What are the contract terms surrounding staff retention by the new owner?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "Do not under any circumstances tell all your employees you are selling. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Wait till the deal done and you have the cash on hand. Until that happens you risk losing employees and messing up the deal.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "Never tell them until after the closing. The buyer will screw you",
    "has_problem": "YES",
    "confidence": 8,
    "category": "legal"
  },
  {
    "text": "I have 92 employees and am coming up on the same situation. Super anxious",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Did you write anything into the contract that new owner would keep current employees on until x date?    If not and he’s going to can them all, then it’s pretty sleazy not to tell them.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "legal"
  },
  {
    "text": "You need to tell people so they at least have time to look for another job. You might be scared but you have 95 people whose livelihoods are depending on you and you'll be screwing over if you sit on this.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Advice. Go to doctor and get some propranolol (beta blocker). Take 3-4 1-2 hours prior to telling staff. Your concerns won’t go away but you will handle the event better.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "health"
  },
  {
    "text": "I went through this. I assumed that no one would be able to properly empathize or understand the sacrifices my co-founder and I had made to set them up for success. I was right. It was mostly complaints and very little gratitude. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Don’t break the news before selling. I’m in the process of selling my business and the buyer backed out a week before closing even though everything went fine with due diligence so I would strongly advise not to tell your employees..",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "You’re not wrong. I’ve had a few marketing folks pitch me on these “custom AI agents” and when I asked for details, it was just a GPT with a prompt that says “act like a receptionist.” ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Your site sucks",
    "has_problem": "YES",
    "confidence": 8,
    "category": "customer_service"
  },
  {
    "text": "AI is a poker machine for workaholics. People sit there endlessly 'prompt engineering' - teaching themselves pseudocode so they train ChatGPT for OpenAI and paying for the privilege.  They're obsessed, despite it being clearly terrible, because it makes them feel good. They love AI agents because it feels just like you're micromanaging a big team that always does what you say. They always competed on how many 'reports' they had under them, now they can just click a button for a new agent. That's why companies that offer Agents are making a killing right now without ever proving validity or reliability.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Instagram seems like it’s a dying platform. I have a business.",
    "has_problem": "YES",
    "confidence": 10,
    "category": "business"
  },
  {
    "text": "How do you guys keep up with social media updates without feeling completely burnt out?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Social Media Manager Wanted",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "🚨Looking for Reddit & Discord Mods! 🚨",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Meta Disabled My Facebook and Instagram Accounts Over a False Accusation—All Because I Asked Meta AI to Analyze a Video",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "A Hard Pill to Swallow as a Social Media Manager",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "I want to start a business. Should I use Social Media as a marketing tool or should I focus on quality content and word of mouth?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Need followers for any social media platform? (The best way to increase reach)",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "What features or trends would you revert to start really using social media agian?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "Getting Started on TikTok: How can I figure it out?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "productivity"
  },
  {
    "text": "Hey creators! Would you use a tool that makes handling brand deals way easier?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Raising Awareness About Unauthorized Recording of TikTok Livestreams",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "If you’re running social content but still not converting, try this",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "What's your 'post and pray' metric that actually predicts virality?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "Archive Site for Twitter and X",
    "has_problem": "YES",
    "confidence": 8,
    "category": "technical"
  },
  {
    "text": "Need help with quora",
    "has_problem": "YES",
    "confidence": 8,
    "category": "productivity"
  },
  {
    "text": "Facebook pages not showing",
    "has_problem": "YES",
    "confidence": 9,
    "category": "technical"
  },
  {
    "text": "What’s the worst Instagram advice you followed that tanked your reach?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "Need Help - confused on authenticity of Alqabas on IG.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "yeah indeed we use morethanpanel and smmraja for our smm panel as reseller and far more better from other smm panels so far. But what about twitter provider mate. any advice?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "What Dmytro Chumak said is something most people active in the field are already aware of but rarely talk about. The expectation that “one panel should solve everything” is quite common but it’s just not realistic. Every panel has its strengths and weaknesses. Some do really well on YouTube, but completely fail when it comes to TikTok",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "If Instagram is dying, my question is: what is well and alive? \nAlso - I do think that Instagram does many things on purpose, such as limiting posts’ visibility, to “gently push” people to pay for visibility.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Meta is a dying platform honestly. At least it somewhat feels that way.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "engagement on instagram has really dropped lately. lots of people are seeing low likes, and barely any comments, even with big followers. feels like the algorithm has changed or people are moving on.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "That only means those pages bought thousands of fake followers. It’s actually one of the best indicators for spotting whether a page’s followers are legit. If they had 30k real legit followers, each (good) post would easily get a few hundred to over a thousand likes.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "I agree. I’m a hair away from deleting. On my personal page, seems like nothing but ads. Or it’s the same post from the same follow (lame) my biz page, where I follow businesses is also lame…",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "Those examples of large accounts with low engagement are definitely concerning. It makes you wonder what's going on behind the scenes with the algorithm and who it's favoring.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "I'd say it's been dying for a while, as my account has had zero growth for years (I gain and lose about equal followers). And engagement and everything has been getting worse and worse. I used to get hundreds of likes per post, then I was lucky if I'd hit 100. Now I'm lucky to hit 30 - and that's with over 4k followers.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "It has most certainly been dying and 2025 has been like no other. Having working in the social media space for over a decade with millions of followers across many platforms, Instagram in 2025 is now heading towards the same ‘pay to play’ strategy as Facebook did around 2016/17. Organic just isn’t working like it used to, follower count aside. Content that resonated with the audience is no longer being served to them. 2025 is really becoming the end for Instagram organically.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "It was bought because it’s competition. The algorithm favors paid profiles and throttle anyone else. I went from having Carrie Underwood’s drummer Garrett Goodwin commenting to a ghost town. Can you imagine the legwork I would have to do to get my stuff in a famous musicians feed again?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "You have to consistently post good reels to get reach and engagement on Instagram now.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "The only reason I keep my account is my business. Just so people know that I’m still operating so I post once in a while. Lot of the content there is just aspirational which I haaate. Bad vibes everywhere.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Wouldn’t say it’s dying, but attention is definitely fractured. People scroll more than they engage, and most of it feels aimless. But at the same time, people are getting better at spotting what’s real and what’s just noise.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "productivity"
  },
  {
    "text": "I don't get anything on IG or threads anymore",
    "has_problem": "YES",
    "confidence": 8,
    "category": "technical"
  },
  {
    "text": "People want to see “real” content now. No touch ups, symmetry etc etc even for luxury brands owned by celebs 😅 There’s a shift happening where people lying in hoodies in bed starting their videos with a good hook holding a mike in their hand has a far better impact than cool transitions and rehearsed speeches. I can feel that shift in me as a consumer too. When it comes to pictures, people want to see the product or service in action. “Lifestyle pics” :) Also - Pinterest isn’t a dying platform so maybe try that if ur selling products.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Instagram algorithm is a course on its own. If you don’t keep up a popular account can gradually disappear into oblivion.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Yeah it’s dying and has been dead for me for a year or so. My content is very good (I know you hear that a lot ) and I believe in it. I have tried growing in Insta so hard for couple of years but as I grow lesser views, lesser interaction. I was getting better engagement when I had 200 followers vs 2000 followers. I make a bee high quality travel content that I work really hard on. I was getting to the point where it was affecting my mental. So I decided to completely give up on it couple of months ago and try to grow in Tik Tok instead.\nBest decision ever in my life. Two months later in tik tok . I am pulling in almost million views per week. Got to rewards program and was even able to land few good collabs. I have about close to 30 legit collab  requests in just past 2 months. I just regret I wasted so much time in shitty Insta app. 2 years .. if I had given that time to Tiktok I would be probably at 100k followers in Tiktok.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Big followers with very small likes has typically meant the followers were bought",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "It's sort of hard to say. My Instagram account has 72,000 followers. Nearly every day I have a post get 1000+ likes. But other posts only get 200-300. It feels like I'm getting about half the engagement that I did a couple of years ago, when I'd regularly post content that gets 2000+ likes.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "People hate being advertised to- what a concept.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "It’s not dying just a Business as you follow don’t get any shares because they don’t add enough value to their audiences.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "Instagram is slowly but surely dying and this is a fact. I switched my brand from Instagram to Tapkeen and I am more than satisfied with the decision",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "anything facebook is toxic, look east my friend",
    "has_problem": "YES",
    "confidence": 8,
    "category": "personal"
  },
  {
    "text": "Because IG is awful. You get caught in some BS, AI wheel that restricts you for nothing. Once you're caught in that wheel, you're basically fked. I got restricted for 10days for asking when a band was going to tour.  There is no recourse unless you've got 10000s of followers. \nShadow banning is bollocks.  You can not have any decent dialogue anymore. ",
    "has_problem": "YES",
    "confidence": 10,
    "category": "customer_service"
  },
  {
    "text": "Definitely not dying. It's just fundamentally changed as a platform over the lastr five years and most accounts struggle to understand 'new instagram' and I am guess the contant of those accounts is simply not engaging! I have two businesses and have grownt them faster than ever on Instagram in the last yearl You just need to know how to work with the platform now. I passionately believe it's the best platform for businesses in 2025 and I'm not just saying that. Most people just don't know how to use it.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Instagram is dead. Zuck doesn’t get enough hate for what he did to FB and Insta. The platform is just teens making fake content - affiliate marketing scams and dropshipping scams and fake money posting, course sellers and grifters and annoying red pill content and anti trans shit and Russian propaganda. There’s no regulation so it’s all fake.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Fake followers. I have 4.1K followers and get 500+ likes and 60+ (I respond to everything so technically 120) even had one with 200 comments and 1.2k likes. Stories are something else though. I sometimes get 1400 views, sometimes only about 300 for some reason.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Since all of the Social Media platform interactions are infested with \"AutoBot Influencers\"... Ladies and Gentlemen, Humanity has left the building! I remember, back in the day, when Social Media was a platform for actual human beings to share ideas, activities and current events for HUMAN consumption and discussion. Yep... Those were the days!",
    "has_problem": "YES",
    "confidence": 9,
    "category": "social_media"
  },
  {
    "text": "You can't rely on one source of exposure online. You need to build your brand across multiple platforms and use SEO, AdWords, Social. You need people to see your brand pop up in different spaces with different approaches depending on the audience. Social is very pay to play these days as well. Organic reach is mostly dead.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "They do whatever they want. They limit visibility, they push propaganda with their algorithms. There is noone controlling them. To this day I do not understand why EU has not banned all meta platforms exactly because of this. They are used to undermine EU from inside and push narratives that they want. Stupid EU sitting doing nothing, judt watching.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "Maybe those are paid followers = High follow count, no interaction.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "Short attention spans now. People have no time to comment anymore. Really sad to see how things are going with social media.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "There are tons of successful businesses on Instagram but if you aren’t adapting to be reels-first in 2025 you are going to fail, I see businesses on my feed all day on Instagram who have crazy high likes and views in comparison to their following. I also work with many brands making thousands to millions from Instagram posts and ads.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "They simply don’t actually have that many followers, lots of businesses buy followers to make it seem like they are popular when in reality they aren’t. Instagram is well and alive",
    "has_problem": "YES",
    "confidence": 7,
    "category": "marketing"
  },
  {
    "text": "Yup. And it's frustrating because now that I want to be serious about IG for marketing my business, I'm expected to pay for visibility. 🙄 But back then when I wasn't trying, I got so much engagement on my posts for free. I was getting well over 30 likes, and I was getting frequent comments and shares! But yeah, now IG is a dying platform that only prioritizes influencers with millions of followers. This heavily hurts small businesses and artists that don't have the money to pay for ads daily.",
    "has_problem": "YES",
    "confidence": 10,
    "category": "marketing"
  },
  {
    "text": "Most accounts on Instagram are filled with fake followers anyway.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "Instagram's organic reach has dropped a lot, especially for business accounts. A lot of those follower counts are inflated from years of giveaways, bots, or inactive users, which explains the low engagement.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "I was using an app to get followers but instagram discovered it, so my account got shadowbanned. Maybe that's happened to the accounts that you follow",
    "has_problem": "YES",
    "confidence": 9,
    "category": "technical"
  },
  {
    "text": "There are no alternatives so use it or lose it - and lose out. It's that simple",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "It's always been... unless you're a nation wide brand, marketing on social media is virtually pointless. A good website, with good SEO, and paid outreach is much more valuable",
    "has_problem": "YES",
    "confidence": 8,
    "category": "marketing"
  },
  {
    "text": "I will say I’m more careful about what I hit like on because it’ll be shown to my followers. Get rid of that and the likes will come back",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "I agree re Insta. I spent a lot of time building up 10k followers for our book business on there. Back in 2019/20 I’d get 500-1000 likes for posts. That started to die off slowly to double figures and now I’m lucky if I get 10 likes. Which is why I no longer bother and have built up an engaged following on TikTok and X instead which brings plenty of business.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "well who is your market audience? you have to treat these platforms as different personalities; viral posts on instagram could do absolute crickets on another app like tiktok.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "marketing"
  },
  {
    "text": "This is so true! Sometimes, the best way to keep up is to step back. I've found that giving myself dedicated 'no social media update' time, or even a full day off from tracking trends, helps prevent burnout.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "I think I spent the first two hours of the morning just checking everything. All the socials, all the Youtubes, all the news developments, answering emails, texts and DMs...",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "How do I find a therapist that won’t try to “finish” therapy?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "Cuddle therapy?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "personal"
  },
  {
    "text": "Looking for the best online therapy sites. Any recommendations?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "Supplement recommendations to manage stress and body trauma responses to returning back home for summer?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "health"
  },
  {
    "text": "How long does it usually take for a therapist to get a broad idea of your problems?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "Do you enjoy when clients message you outside of session, or resent them?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "What psychology/counseling techniques work best (or quickest) to reveal repressed or hidden trauma for mature adults?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "health"
  },
  {
    "text": "Is distracting the brain good for rumination? Instead how can I just get over the thought?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "personal"
  },
  {
    "text": "lost access to my therapy, good alternatives?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "Can I still see my therapist when I move for college?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "How do I save time in text therapy?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Psychologist from Belgium – how do I build an online caseload of private clients (EU or international)?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Can therapy help me?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "personal"
  },
  {
    "text": "I had a therapist who did this so often that I began to think she was doing this so that she’d have to do less therapy work. This was in a group setting. Sometimes the silence would go for as long as five minutes. She did this several times per session, it really wasted the time we had per session.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "I actually HATE the \"silence used as a tool.\" It feels wildly condescending to me as a concept. Thankfully my psych doesn't do it but I would quit one who did, the fact the therapists' sub is such a fan of it blows my mind.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "Ask then why they're giving you the silent treatment. You aren't a mind reader. You are paying for a service.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "customer_service"
  },
  {
    "text": "Yes, but only about this one counselor I really connected with. I had crisis counseling after another sexual assault and she advocated for me to get 25 sessions instead of the normal 10. She was in  the midst of getting her masters.I'll never forget how much she helped me. She was the one who helped me get a psychiatrist which led to my diagnoses of GAD, OCD, ADHD, and PTSD. I remember her full name, her orange tabby Andrew, her pretty blond hair, how she hugged me after our last couple sessions, her love of amethyst, crochet, and arbutus trees. She was the best.\nI check out her linkd in profile every now and then to make sure she's still practicing. Maybe one day when I can afford it I'll reach out lol\nIt's an ironic blessing that I can't get in touch with her for free because I'm no longer in need of crisis counseling thanks to her help 💚💖💙",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "Yes, I agree that someone who works psychoanalytically/psychodynamically or other depth modalities may be a good fit for you.  It’s possible it may be challenging to find someone using insurance, though, since sometimes insurance pressures are for fewer sessions that address current functioning and symptoms, rather than doing some of the deeper explorations you are looking for. You may want to consider whether it’s possible/accessible for you to pay out of pocket, which could expand the pool of possible therapists.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "Using insurance might make this more difficult as insurance companies are the ones who want that quick, solution-focused approach. You might be better able to receive this kind of therapy as a self-pay client. However, there are therapists who are seasoned in justifying medical necessity for the type of therapy you are seeking. If I were in your shoes, I'd probably look for therapists who pull from psychodynamic, EMDR, and attachment-focused approaches.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "Honestly, insurance and EAPs are pushing therapists to “graduate” clients in a very short period of time. If you don’t want to feel rushed, I would highly recommend going out of network if that’s an option. Also discussing this with your therapist is important too. But especially with EAP clinicians they are being rewarded for value based care and many insurance companies are starting to adopt that as well…",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "I Have Downtime at Work What’s the Smartest Way to Use It?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "productivity"
  },
  {
    "text": "Help me out with brainrot , I can't function properly",
    "has_problem": "YES",
    "confidence": 8,
    "category": "health"
  },
  {
    "text": "Anyone else do multi-site searches daily? I made a spreadsheet to save 50+ clicks",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Does anyone else feel like productivity apps aren't enough?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Is there a desktop app for productivity",
    "has_problem": "YES",
    "confidence": 8,
    "category": "productivity"
  },
  {
    "text": "Basic habit tracker for IOS (like for Loop on Android)",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Is there any calendar app like google calendar (all of its features) that can combine calendars into 1 calendar?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Trying to fix the news overload would love your thoughts",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "How do I improve my speech and communication style?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "personal"
  },
  {
    "text": "Feeling overwhelmed – Need help planning my day & breaking bad habits",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Montly time calculation app Google Calendar based",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "My Reading List is 1000+ unread articles and causing me stress and guilt — how do you manage yours?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "How to adjust energy limits in MATERIALS STUDIO to avoid errors during amorphous cell calculations?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "technical"
  },
  {
    "text": "1-3-5 method issues - Can't find enough tasks!",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "How to overcome phone addiction",
    "has_problem": "YES",
    "confidence": 9,
    "category": "health"
  },
  {
    "text": "Take a course online that allows you to go at your own pace, no deadlines so you can learn when you have time and pick something that you think you could benefit from, something that you suck at. I'm taking a free bookkeeping class in June that my library offers because I want to be more financially literate. So, find something relevant to your life right now that you think would benefit you.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "One of the biggest game-changers was offloading calendar and meeting management. Having someone handle scheduling, rescheduling, and protecting focus blocks freed up a surprising amount of mental energy. It reduced context switching and helped maintain momentum throughout the day. A close second was delegating inbox filtering—just not having to scan through dozens of low-priority messages each morning was a huge relief. Both felt small at first but added up fast. Wish I’d done it earlier.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Sending Email's Manually and scheduling meetings Automating this helped me save 5 hours a week .",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "One thing at a time. Don’t think about what you could have done or wasting prior time.  If possible, find someplace away from your distractions to work.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "productivity"
  },
  {
    "text": "Advice on quiet quitting while behaving professionally despite knowing both company and boss fucked me with no regrets?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Passed over for promotion.. What’s the next move?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Ever spend 30 minutes crafting the perfect email response… only to realize you were just CC’d?",
    "has_problem": "YES",
    "confidence": 8,
    "category": "productivity"
  },
  {
    "text": "I ran out of jobs to apply to and my network is tapped, what now? ☹️",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Feeling Stuck After Graduation",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Flame my resume. I’m a junior accounting major.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "Can't land an internship?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Why I am not getting any interviews...",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "How to deal with imposter syndrome?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "personal"
  },
  {
    "text": "37 here. Restaurant general manager. After a couple of years of adding the bookkeeping aspect of the job to my repertoire, attempting to analyze financial statements with no formal schooling in the matter I decided to go to school to take a bookkeeping cert. I quickly realized a bookkeeping cert will not get me far at all in terms of a lucrative career change. I quickly changed programs to an accounting major degree program. Unfortunately, I will have to do this part time while working. But am very excited to carry on with the studies and hopefully get some work at a firm somewhere in the middle of my degree. 🤞. My only post secondary was culinary school so I am starting from scratch. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "I switched to accounting in my 40s. I was in the printing industry. Aside from being a rapidly dying industry, it also sucked ass.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "I’ve been taking classes slowly since 2020 when I was 31 and finally have 21 Accounting credits and been applying to Accounting positions. Got my first interview at 36 😅",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "No, when I was majoring in acct back then saw lots of people in their 30s go back to school to get an acct degree/certificate. You’ll be fine. Only thing is acct might not be as stable as it was back then, but that’s the entire economy right now.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "I'm doing it now. Early 30s. And a handful of people in my program are like me, teachers who are leaving teaching and switching into accounting.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "I went back to school for accounting and got my CPA at 30 right before I started at b4. The fresh out of college staff would make occasional awkward comments about it. Overall it was a good move for me. Fast forward 12 years and one issue with my age that I now face is that my firm has a 20 year vesting schedule for partners and I don’t think they’re gonna make me a partner in the next 3 years.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Being older in accounting is not a big deal\nBc it’s a common career changing field but the cost of getting the CPA is high and it doesn’t always pay as high as you might feel it’s worth. In your 30s the main issue is you might have more life and family commitments and if you choose public accounting, the hours are demanding. You also need to be more strategic with your resume to be taken seriously by employers. However, It will be a more comfortable life than retail with tons more growth opportunity. ",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "I just turned 31 and still have like three years left. I’m working in manufacturing and my body kills be everyday so I needed a change. Glad I’m doing it!",
    "has_problem": "YES",
    "confidence": 8,
    "category": "professional"
  },
  {
    "text": "I was criminal justice oriented all my life until I got to 27. I had never touched any subject business or finance related. Had a wake up call when I realized I’d soon be out of my 20s and still didn’t have a real job. I took a random accounting class and now I’m well on my way to a bachelors in accounting. Make the change. It’s NEVER too late.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "Doesn’t this incentivize businesses to pay their employees absolute minimum wage and push the broken tipping culture even more into madness?",
    "has_problem": "YES",
    "confidence": 9,
    "category": "business"
  },
  {
    "text": "More like more people will claim the tips to get the credit on the withholding, only to find out they have to pay the FICA tax. When they would have not claimed the cash tips at all.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "I won’t be tipping anymore.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "customer_service"
  },
  {
    "text": "It's only $25,000 in cash tips that are exempt from federal taxes. Employees must claim the tips so the employer can withhold payroll taxes. Almost no one claims the small amount of cash tips they currently get. This is literally just a way to get them to claim those cash tips and still get SOME tax from it, just not as much as it normally would be with federal taxes.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "financial"
  },
  {
    "text": "More fraud and less IRS agents to catch it, they cooked.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "legal"
  },
  {
    "text": "Usually reliable way to middle income or high middle income jobs. Work life balance can suck at times (month end, quarter, annual close and audit in industry. Peak seasons in public). Industry it is easy to get overlooked since we aren't revenue generators. There's some apprehension about AI and offshoring and it certainly seems justified in some areas.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "professional"
  },
  {
    "text": "The baby boomer retirements through 2030 are supposed to be insane and everyone seems to have forgotten about it. ",
    "has_problem": "YES",
    "confidence": 8,
    "category": "business"
  },
  {
    "text": "When the IRS staff catches up to this and agrees with you, it’ll be 2026-27.",
    "has_problem": "YES",
    "confidence": 8,
    "category": "government"
  },
  {
    "text": "I’ve just accepted my fate at this point…I’m 20 month from paying off my students loans and I’m in my early 30s so I just don’t have it in me to switch…also ageism is a bitch.",
    "has_problem": "YES",
    "confidence": 9,
    "category": "financial"
  },
  {
    "text": "The 1st four months is hell but the other 8 months is pretty peaceful",
    "has_problem": "YES",
    "confidence": 8,
    "category": "personal"
  }
]